[
    {
        "event": "earthquake",
        "title": "Another earthquake shakes Great Falls - KRTV",
        "description": "Another earthquake shakes Great Falls  KRTV",
        "content": "Many people reported feeling what they believe was a small earthquake on Saturday, January 31, 2026 - and the U.S. Geological Survey confirmed that it was a magnitude 3.2 quake.\n\nIt happened at 6:22 p.m., and was centered about 1.8 miles northwest of Malmstrom Air Force Base at a depth of six miles.\n\nWe began receiving reports at about 6:23 p.m. Among the messages we received:\n\n\n\nI felt a rumble and so did my neighbor. 2 blocks from Montana Credit Union\n\nPossible aftershock that just happened at 6:23 pm\n\nFriend also said they felt it in riverview\n\nMy parents said they felt it\n\nAfter shock??? 6:27pm??\n\nDid we have another aftershock just now?\n\nAnother earthquake just now. Not as strong as the previous one\n\nHeard boom about 7 minutes ago, another after shock?\n\nAt this point, there are no reports of any injuries or damage.\n\nWe will update you if we get more information.\n\nThis comes just two days after a magnitude 4.2 quake rattled the area, centered about 4.9 miles northeast of Great Falls.\n\nSeismologists said that small aftershocks are possible in the days after the initial quake, which is likely what happened on Saturday.\n\nOn Thursday, KRTV was interviewing Cascade County Sheriff Jesse Slaughter (for an unrelated story) when the earthquake hit - watch the video:\n\nResidents react as earthquake shakes Great Falls\n\nThe Treasure State is in one of the most seismically active regions in the United States. The intermountain seismic belt, which runs through the western third of the state, is where most of the earthquake activity occurs in Montana. The vast majority of the many quakes across the region are very small, rarely felt by people, and cause no damage. There is a team of experts at the Yellowstone Volcano Observatory who keep track of them all; click here to visit the website.\n\nThere is also an Earthquake Studies Office on the campus of Montana Tech in Butte. It operates the Montana Regional Seismic Network, a network of 42 permanent seismic stations located throughout western Montana. The website notes: \"Although it has been over four decades since the last destructive earthquake in Montana, small earthquakes are common in the region, occurring at an average rate of 7-10 earthquakes per day.\"\n\nThe website features several interactive maps, including one that shows the 2,395 earthquakes recorded in Montana during 2018 and additional earthquakes in the surrounding region. All but 23 of those quakes registered as less than 3.0, which demonstrates how small and imperceptible the vast majority are.\n\nThere have been some notable earthquakes in Montana’s history, including the 7.3 magnitude Hebgen Lake earthquake on August 17, 1959. The earthquake triggered more than 160 new geysers throughout Yellowstone National Park. There were also around 28 fatalities from a rockslide in Madison Canyon.\n\nAnd on July 6, 2017, one of the strongest earthquakes to hit Montana in decades shook the community of Lincoln northwest of Helena. It was centered 5.5 miles southeast of Lincoln at a depth of about 2.6 miles. People reported feeling the 5.8 magnitude quake across Montana and the northwest, with some reports coming from as far away as Vancouver and Lethbridge, Canada. It caused some minor damage, but no serious injuries.\n\nIn January 2026, a 4.2 quake shook several miles northeast of Great Falls; no injuries and no serious damage were reported - click here for details.\n\nThe quake happened at 12:41 p.m., and was centered about 4.9 miles northeast of Great Falls at a depth of about 13.6 miles.\n\nMTN News was interviewing Cascade County Sheriff Jesse Slaughter (for an unrelated story) when the earthquake hit - watch the video:\n\nResidents react as earthquake shakes Great Falls\n\nThe plains of central and eastern Montana are much less prone to quakes, but there have been a handful of significant ones reported.\n\nAccording to the USGS, a 5.3 magnitude earthquake struck northeastern Montana on May 15th, 1909.\n\nSeveral smaller quakes have been recorded in Roosevelt County, including an estimated 4.5 magnitude quake in the town of Froid that resulted in some damage to a grain bin back in 1943.\n\nAlthough it has been some time since the state has seen a destructive earthquake, small quakes occur several times every day. Click here to learn more about earthquake preparedness.",
        "link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOQl9YZkZoLUpNMUIyMVl3MXIyMzRfa0ozMUJodTc0MVJMNEhNWG0zenBJcWtfZzZCa3pzb2pfdklkQzZSa1dtbnBqb0dxMXR3Yy1OQXZ2OFN4aTVhWWtJbFlCRGJ4VzB3Ukw4U0tCeUJjYUx3YWlVcWR3a0NxdjNNOUdwQmhZRUp6YWJGSHppZFo?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sun, 01 Feb 2026 01:57:03 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "earthquake",
        "title": "Map: 2.3-Magnitude Earthquake Reported in New Jersey - The New York Times",
        "description": "Map: 2.3-Magnitude Earthquake Reported in New Jersey  The New York Times",
        "content": "Map: 2.3-Magnitude Earthquake Reported in New Jersey\n\nNote: Map shows the area with a shake intensity of 3 or greater, which U.S.G.S. defines as “weak,” though the earthquake may be felt outside the areas shown. The New York Times\n\nA minor, 2.3-magnitude earthquake struck in New Jersey on Friday, according to the United States Geological Survey.\n\nThe temblor happened at 3:42 p.m. Eastern about 3 miles southwest of Bedminster, N.J., or about 35 miles west of Manhattan, data from the agency shows.\n\nU.S.G.S. data earlier reported that the magnitude was 2.4.\n\nAs seismologists review available data, they may revise the earthquake’s reported magnitude. Additional information collected about the earthquake may also prompt U.S.G.S. scientists to update the shake-severity map.",
        "link": "https://news.google.com/rss/articles/CBMiggFBVV95cUxONEJhYVhQdGNNNllMTUkwSFBaNWR5T2g0Y1VRWDRrRXRDU21PVU1HVllQNlQ1YTEwaDdUUDBuYkRKdU95S2V5ZWJEbGFDMFBLWC02MGJpbHhSZnBxTVNzNkNURzhBLWhWT2xNbkxOSlVyWDVzdjZ4OXl2SGVCdFQ5S0h3?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 23:00:45 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "earthquake",
        "title": "Seismic-like event, possible earthquake, reported about 10 minutes ago near Great Falls, Montana, USA - Volcano Discovery",
        "description": "Seismic-like event, possible earthquake, reported about 10 minutes ago near Great Falls, Montana, USA  Volcano Discovery",
        "content": "FOX 29 News Philadelphia · Saturday, Jan 31, 2026 | 11 hours ago · EARTHQUAKE\n\nIt happened in Whitehouse Station, New Jersey, which is about 60 miles outside New York City. A small earthquake was reported in New Jersey on Friday as the region braces for more bitter cold and continues to clean up after this past weekend's snowstorm. What …\n\nIt happened in Whitehouse Station, New Jersey, which is about 60 miles outside New York City. A small earthquake was reported in New Jersey on Friday as the region braces for more bitter cold and continues to clean up after this past weekend's snowstorm. What we know: A 2.4-magnitude earthquake was reported near Whitehouse Station, New Jersey, around 8:42 p.m. Friday. Whitehouse Station is in Hunterdon County, which is about 60 miles outside New York City. More than 200 people reported the quake to the USGS, stating they felt weak to light shaking, with intensity reaching just 2-4 out of 10. Earthquakes with a magnitude of 3.0 and below are not considered to be very dangerous or damaging, according to the USGS. Dig deeper: New Jersey doesn't typically come to mind when you think of earthquakes, but the state was rattled by two in just one month this past summer. In August, a 2.7-magnitude earthquake hit New Jersey, just outside of New York City. It came just days after another …\n\nRead more",
        "link": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxNbnk5TlF3Y0s1MEZHLVF3a3hidkJYVk5hQ2hXa3phWF9pdXA4WlBhNG1kRlNpYjhRY2NhSVVNRUtwSDE1TG55MlVxTHI3RVZPc2s3U01pYmR5blpkVDQxNWVmbzlDNm1VS29ETHFRdXVWVG0zaFdReERoQ3ZiaU1iaEduU3gxdS1WMEdBbmhiUGFPUjV3MGpoR0hWSlRnbGU4NTkyeDYySXhPTzJyRm5kQUxzZlRnTGJVLU1MWjdqQnU4S3k1ZEpPNFNOWFc2bXB5WUdrZm5WekNRN2pHMXBEdkU5TVVqTVZxcmZVMTYwNA?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sun, 01 Feb 2026 01:50:44 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "earthquake",
        "title": "Residents react as earthquake shakes Great Falls - KRTV",
        "description": "Residents react as earthquake shakes Great Falls  KRTV",
        "content": "(UPDATE, 6:35 p.m.) A second and much smaller earthquake shook the area at about 5:47 p.m. It was centered just south of the earlier and larger one, and registered as a 2.7 quake, according to the US Geological Survey. Several people reported to KRTV that they felt it.\n\nAn earthquake shook in Cascade County on Thursday, rattling buildings and surprising residents across Great Falls and beyond.\n\nInitial reports indicated a 5.1 quake, but the U.S. Geological Survey soon confirmed that it registered as a 4.2 quake. The quake happened at 12:41 p.m., and was centered about 4.9 miles northeast of Great Falls at a depth of about 13.6 miles.\n\nMTN News was interviewing Cascade County Sheriff Jesse Slaughter (for an unrelated story) when the earthquake hit - watch the video:\n\nResidents react as earthquake shakes Great Falls\n\nThe shaking was felt across the city, causing buildings, shelves, and furniture to tremble for several seconds. Most people reported that the shaking and rumbling lasted for about 10 to 15 seconds.\n\nAt Ferrin’s Furniture in Great Falls, business owners say the quake was impossible to miss.\n\n“It shook us up pretty good,” said owner Andy Ferrin said. “Little jarring. Yeah, I've been here for 30 years of my life, and that's the second earthquake I felt.”\n\nFerrin said nothing fell or broke but said you could almost see the walls moving: “Almost lost my footing. I was talking to customers at the time who were from California, and they said ‘Yep, it was an earthquake!’ I thought something exploded outside.”\n\nAngel Gonzalez was livestreaming when the quake hit - watch:\n\nGreat Falls man livestreams earthquake\n\nAmong the messages and comments from people who felt it:\n\n\n\nMy kitchen was shaking bad and it freaked me out - in GF near target\n\nWell 4th floor at Benefis north was a wake up...\n\nIt rumbled like someone had ran the car into our house!\n\nA few things on the mantle toppled and one actually fell.\n\nIt felt like something hit the side of my house.\n\nHuge boom and rattle. Shook me up so bad\n\nWe thought our deck was going to shake apart\n\nRattled our house, knocked stuff off shelves in our kitchen.\n\nWe also received reports that people felt it in Chester, Shelby, Bigfork, Helena, and White Sulphur Springs.\n\nMalmstrom Air Force Base, which maintains scores of nuclear missile across the region, said in a news release: \"We can confirm there has been no impact on our Airmen or our mission. All operations are proceeding as normal. Immediately after the event, teams of our dedicated Airmen conducted thorough inspections across the entire base and the missile complex. We have found no damage to any of our equipment or facilities, and the security of the missile complex remains fully intact.\"\n\nNo injuries or major damage have been reported as a result of the quake.\n\nEarthquake centered NE of Great Falls\n\nHowever, the sudden movement prompted widespread concern and curiosity, leading many residents to check in with friends, family, and civic leaders.\n\nThe earthquake also led to an increase in emergency calls. Authorities say the police department received 73 calls to the 911 emergency line related to the quake within a 20-minute span - compared to a usual average of six per hour - though none were emergent.\n\nOfficials reminded residents that 911 should only be used for true emergencies, even during unusual events like earthquakes, and that non-emergency lines are the appropriate option for general questions or concerns.\n\nEARTHQUAKES IN MONTANA\n\nThe Treasure State is in one of the most seismically active regions in the United States. The intermountain seismic belt, which runs through the western third of the state, is where the majority of the earthquake activity occurs in Montana. The vast majority of the many quakes across the region are very small, rarely felt by people, and cause no damage.\n\nThere is a team of experts at the Yellowstone Volcano Observatory who keep track of them all; click here to visit the website.\n\nHowever, there have been some notable earthquakes in Montana’s history, including the 7.3 magnitude Hebgen Lake earthquake on August 17, 1959. The earthquake triggered more than 160 new geysers throughout Yellowstone National Park. There were also around 28 fatalities from a rockslide in Madison Canyon.\n\nAnd on July 6, 2017, one of the strongest earthquakes to hit Montana in decades shook the community of Lincoln northwest of Helena. It was centered 5.5 miles southeast of Lincoln at a depth of about 2.6 miles. People reported feeling the 5.8 magnitude quake across Montana and the northwest, with some reports coming from as far away as Vancouver and Lethbridge, Canada. It caused some minor damage, but no fatalities or serious injuries.\n\nIn January 2026, a 4.2 quake shook several miles northeast of Great Falls; no injuries and no serious damage reported - click here for details.\n\nThe plains of central and eastern Montana are much less prone to quakes, but there have been a handful of significant ones reported.\n\nAccording to the USGS, a 5.3 magnitude earthquake struck northeastern Montana on May 15th, 1909. Several smaller quakes have been recorded in Roosevelt County, including an estimated 4.5 magnitude quake in the town of Froid that resulted in some damage to a grain bin back in 1943.\n\nAlthough it has been some time since the state has seen a destructive earthquake, small quakes occur several times every day. Click here to learn more about earthquake preparedness.",
        "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPOXNYTnFJdlBUa2l5Rm5PX2hONGlzbzkzOEdvYjBYWGd0bzVyT1ZONWZQaUt5VmdYRDV1SXdBTGp5VmtWZVF6RkgyZUJFTXg5d2tGelBBdmFWRV9aay1fOTBNWTVoc2pRUU5ablI1blhwR2dHQnZTMUc4d2Rtc3d5MGNQSTFVSXJhV0I5dTVZLUJzcno0d2c?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 20:48:53 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "earthquake",
        "title": "Update: Jan. 30 - 3.4 magnitude earthquake reported near San Ramon, CA - San Luis Obispo Tribune",
        "description": "Update: Jan. 30 - 3.4 magnitude earthquake reported near San Ramon, CA  San Luis Obispo Tribune",
        "content": "Earthquakes Update: Jan. 30 - 3.4 magnitude earthquake reported near San Ramon, CA\n\nCONTRA COSTA COUNTY, CA - Friday morning, a 3.4 magnitude quake was detected close to San Ramon, according to the U.S. Geological Survey.\n\nThe tremor rattled the area at 10:33 a.m. It occurred at a depth of 6 miles with the epicenter located about 2 miles southeast of San Ramon.\n\nDid you feel it?\n\nYou can let the USGS know if you experienced the earthquake by filling out their Felt Report form. The agency has received 634 responses on its online form so far, from people reporting they experienced the quake. According to the USGS DYFI report, people in several cities, including Burlingame, Berkeley, Martinez and Oakland, reported experiencing weak shaking from the tremor.\n\nDid you capture the effect?\n\nIf you have photos showing the aftermath of the earthquake, we invite you to share them with us at sacbee.com/customer-service/submit-photo.\n\nPast week's quake\n\nLast week, a magnitude 3.0 quake was registered nearby, with the event occurring near Pittsburg five days ago.\n\nWhat to know about earthquakes\n\nMagnitude measures the energy released at the source of the earthquake, the U. S. Geological Survey says. It replaces the old Richter scale. Quakes between 2.5 and 5.4 magnitude are often felt but rarely cause much damage, according to Michigan Tech. Earthquakes below 2.5 magnitude are seldom felt by most people.\n\nEarthquakes' sudden, rapid shaking can cause fires, tsunamis, landslides or avalanches. They can happen anywhere, but are most common in Alaska, California, Hawaii, Oregon, Puerto Rico and Washington, according to the Department of Homeland Security.\n\nIt is estimated that there are 500,000 detectable earthquakes in the world each year. 100,000 of those can be felt, and 100 of them cause damage.\n\nWhat to do during an earthquake\n\nIf an earthquake strikes, it's best to protect yourself right away. Here are tips from experts:\n\nIf you're in a car: Pull over and stop. Set your parking brake.\n\nIf you're in bed: Turn face-down and cover your head with a pillow.\n\nIf you're outdoors: Stay away from buildings. Don't go inside.\n\nIf you're inside: Stay and don't run outdoors. Stay away from doorways.\n\nThe best way to protect yourself during an earthquake is to drop, cover and hold on, officials say. \"Wherever you are, drop down to your hands and knees and hold onto something sturdy,\" officials say. \"If you're using a wheelchair or walker with a seat, make sure your wheels are locked and remain seated until the shaking stops.\" Be sure to cover your head and neck with your arms, and crawl under a sturdy table if possible. If no shelter is available, crawl to an interior wall away from windows. Once under a table, officials say you should hold on with one hand and be ready to move with it.\n\n\"There can be serious hazards after an earthquake, such as damage to the building, leaking gas and water lines, or downed power lines,\" officials say. \"Expect aftershocks to follow the main shock of an earthquake. Be ready to Drop, Cover, and Hold On if you feel an aftershock.\"\n\nSource: The U.S. Geological Survey\n\nUnited Robots California\n\nThis story was originally published January 30, 2026 at 10:38 AM.",
        "link": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQblZzQzdPMlF2aExocUlnLURQaGtzOVhkeGVpY2VSMjJtb2JKZjBnMHBvdldEQWs0bG1MTTR2VXNPTGRvUWFnU1pCUkd0eThrNEhNMko2bUw5UE1MdzhCR0pGUkZaYW9KelhwMTFnMDVRbGMxUnFKVmEtMGhnRlE2Q0VQU1BhUQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 21:15:05 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "wildfire",
        "title": "Breaking: New wildfire reported in Los Angeles County on Jan. 31 - Sacramento Bee",
        "description": "Breaking: New wildfire reported in Los Angeles County on Jan. 31  Sacramento Bee",
        "content": "Fires Breaking: New wildfire reported in Los Angeles County on Jan. 31\n\nUpdates on California wildfires.\n\nThe creation of this content included the use of AI based on templates created, reviewed and edited by journalists in the newsroom. Read more on our AI policy here.\n\nFirst discovered: 3:05 p.m. Jan. 31\n\nInitial location: Los Angeles County, Calif.\n\nFire type: Wildfire\n\nFire name: LAC-037919\n\nA new wildfire was reported today at 3:05 p.m. at in Los Angeles County, California.\n\nThe wildfire has been burning on private land. There is no update on the containment of the fire and its cause has not yet been determined.\n\nSource: National Interagency Fire Center\n\nUnited Robots Sacramento",
        "link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9tdEFOT0tndGE2T0hMdXBVTnUxNFk4M1QxQXRKdVBFN0tGd3pCZUtHcDE2bnRfaktRdGVpV2I3djBTTjVVNnlyMG80ZFcyZk5laXo1UWpnODdoaW53Y2lKUzVNS3dLclRPMUN1azY2MF8zWUow?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 23:34:48 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "wildfire",
        "title": "Breaking: New wildfire reported in Los Angeles County on Jan. 31 - San Luis Obispo Tribune",
        "description": "Breaking: New wildfire reported in Los Angeles County on Jan. 31  San Luis Obispo Tribune",
        "content": "Fires Breaking: New wildfire reported in Los Angeles County on Jan. 31\n\nUpdates on California wildfires.\n\nThe creation of this content included the use of AI based on templates created, reviewed and edited by journalists in the newsroom. Read more on our AI policy here.\n\nFirst discovered: 4:26 p.m. Jan. 31\n\nInitial location: Los Angeles County, Calif.\n\nFire type: Wildfire\n\nFire name: LAC-038015\n\nA new wildfire was reported today at 4:26 p.m. at in Los Angeles County, California.\n\nThe wildfire has been burning on private land. At this time, the containment status is unknown and the cause of the fire remains undetermined.\n\nSource: National Interagency Fire Center\n\nUnited Robots Sacramento\n\nThis story was originally published January 31, 2026 at 5:00 PM.",
        "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5XZDdWTlE5Qm9UQU82enlFN09yV0JXQmZtb2U5N2xCZ0taSk9uc0x0ZmQydDQ1bG5fU1NjN1Y4c1J4NHRSRWxPWVVFY3hGM3BOZi1YQkFPeF9qVmllMUZGOFV5NzRKTi1hNEZNVUZyWGg3UlJoSmd4TEtDNXRPUQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sun, 01 Feb 2026 01:17:05 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "wildfire",
        "title": "Breaking: New wildfire reported in Mariposa County on Jan. 31 - Fresno Bee",
        "description": "Breaking: New wildfire reported in Mariposa County on Jan. 31  Fresno Bee",
        "content": "Fires Breaking: New wildfire reported in Mariposa County on Jan. 31\n\nUpdates on California wildfires.\n\nThe creation of this content included the use of AI based on templates created, reviewed and edited by journalists in the newsroom. Read more on our AI policy here.\n\nFirst discovered: 3 hours ago, 11:25 a.m. Jan. 31\n\nInitial location: Mariposa County, Calif.\n\nFire type: Wildfire\n\nFire name: 15e1 Abandoned Campfire 6s24\n\nA new wildfire was reported today at 11:25 a.m. in in Mariposa County, California.\n\nThe wildfire has been burning on federal land managed by the United States Forest Service for three hours. Currently, there is no information on the containment of the fire and the cause of it remains undetermined.\n\nSource: National Interagency Fire Center\n\nUnited Robots Sacramento\n\nThis story was originally published January 31, 2026 at 3:01 PM.",
        "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1HclBsY3MxU3FybEZlakJHNHFTVVVxc1BodmNfb1BNdUw2QzZNeUMtSDN5R19tLUFDNGdUbGZ2OHdUVG1pLXoxX3hkSXJWRHhBWTA2R0gxanRxb2tIak5COWIxMm5RWDFteFdROW96NEZNSFgzclVMWg?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 23:08:03 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "wildfire",
        "title": "Salesforce Expands Into Defense And Wildfire AI With Long Term Deals - Yahoo Finance",
        "description": "Salesforce Expands Into Defense And Wildfire AI With Long Term Deals  Yahoo Finance",
        "content": "Find your next quality investment with Simply Wall St's easy and powerful screener, trusted by over 7 million individual investors worldwide.\n\nSalesforce (NYSE:CRM) secured a US$5.6b, 10 year contract with the U.S. Army to support digital modernization and AI enablement.\n\nThe company also launched EMBERPOINT LLC, a wildfire response venture with Lockheed Martin, PG&E, and Wells Fargo.\n\nBoth developments expand Salesforce's role in government technology and public safety infrastructure beyond its core CRM offering.\n\nFor investors watching Salesforce, these moves show the company leaning further into large scale, mission critical technology roles that extend beyond customer relationship management. The long term U.S. Army engagement centers on data, AI, and operations, areas that many enterprise and public sector buyers are prioritizing as they upgrade aging systems.\n\nThe EMBERPOINT venture brings together aerospace, utilities, finance, and cloud software around wildfire response, which could be relevant if you follow climate risk, critical infrastructure, or AI driven decision support. Together with the Army contract, these developments present Salesforce as a technology supplier to complex, long duration projects where reliability, security, and data integration are central considerations.\n\nStay updated on the most important news stories for Salesforce by adding it to your watchlist or portfolio. Alternatively, explore our Community to discover new perspectives on Salesforce.\n\nNYSE:CRM 1-Year Stock Price Chart\n\nWhy Salesforce could be great value\n\nFor investors, the key takeaway is that the US$5.6b, 10 year Army IDIQ contract is a potential demand signal for Salesforce’s AI powered data and workflow tools in highly sensitive workloads, even though the full contract value depends on future task orders. EMBERPOINT sits alongside that as another real world use case for Salesforce’s AI and data fabric, this time in critical infrastructure and public safety. This broadens its reference cases beyond commercial CRM and helps it stand alongside peers like Microsoft and ServiceNow when governments and utilities compare vendors.\n\nHow This Fits The Salesforce AI Narrative\n\nThe Army contract and EMBERPOINT align closely with the existing narratives around Salesforce’s push into agent based AI, Data Cloud and consumption style monetization, because both rely on unified data and AI agents to coordinate complex operations. These announcements also reinforce the idea that Salesforce’s long term AI story is not limited to sales and marketing workflows, but also spans defense, public sector and utilities, which many investors already track as important use cases in the company’s AI narratives.",
        "link": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOYlNYYmFTejFxcktrR254dWZxZmQ5bnhYWXNiM2RtdUtFOEpOckhkdlRvRWlKdWtiM1N6RTQ3djMzRDNGendRV08zYTlWMzF2c2tyYXIyU01uMXZEMVZrcEE0cmpha1JlbVFuekh4RmM3LVVOTnpzb21LbXVSOTZnRUlDeUxKMDZ6QS1kcQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 21:08:17 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "wildfire",
        "title": "Beetle-mania’: Colorado scientists and citizens question state officials’ claim that beetle-killed forests increase wildfire risk - Post Independent",
        "description": "Beetle-mania’: Colorado scientists and citizens question state officials’ claim that beetle-killed forests increase wildfire risk  Post Independent",
        "content": "Some scientists and Colorado residents are raising concern that the state’s messaging and management of beetle-killed forests do not align with the published research on the interaction between dead trees and wildfires.\n\nMountain pine beetle impacts are receiving renewed attention after Colorado Gov. Jared Polis issued an executive order in December to assemble a task force aimed at responding to a beetle outbreak affecting ponderosa forests on the Front Range.\n\n“Colorado has long been a leader in forest health and fire mitigation efforts, and this is no exception,” Polis said in a news release announcing the executive order. “As the latest outbreak of pine beetles begins to take shape along the densely populated Front Range, we are taking an aggressive approach to boost tools and partnerships to protect our communities, forests, and key water sources, and equipping homeowners with the resources they need to protect their homes.”\n\nAerial forest health surveys conducted last year by the U.S. Forest Service and Colorado State Forest Service reveal a “significant and expanding mountain pine beetle outbreak in Ponderosa pine forests up and down the Front Range,” according to the news release. In addition to creating a task force focused on the beetle outbreak, Polis’ Office said it will seek to extend funding for “critical wildfire mitigation” and tax incentives for companies to remove beetle-killed trees for use in products.\n\nThe news release states that beetle-killed forests increase the wildfire risk to communities and claims that “early action is essential to reducing long-term fire risk” because “as mortality increases, standing dead timber can intensify fire behavior.” The release quotes state and federal officials, as well as agency heads, some of whom repeat these claims.\n\nHowever, interviewed scientists and a review of published research on the topic , refutes the common premise that trees killed by mountain pine beetles are more susceptible to wildfires and increase wildfire severity. Some peer-reviewed research on the topic suggests that beetle-killed trees can be less flammable.\n\nThomas Veblen, a retired University of Colorado Boulder professor who has studied mountain pine beetle outbreaks and wildfires in Colorado, was among those who were frustrated by the claims made by the Governor’s Office.\n\n“The messaging that is aimed at alarming the public about increased fire risk due to beetle-caused tree mortality is not consistent with the published research,” Veblen said. “What has been left out of the press releases on this, or the one press release, is some summary of what was learned from the previous beetle emergency from the late 1990s through the early 2000s.”\n\nThe Governor’s Office forwarded emailed questions from Summit Daily News regarding the wildfire risks of beetle-killed forests to the Colorado State Forest Service and state Department of Natural Resources.\n\nAfter consulting with experts, state Department of Natural Resources communications director Chris Arend said, the “likelihood of wildfire (annual burn probability or chance of a fire starting) doesn’t change due to beetle activity. Arend added, “it is worth acknowledging that research on the interactions between beetle-killed trees and wildfires is evolving.” More research is needed, he said, noting that the issue is “nuanced.”\n\nThe news release from Polis’ also notes that “beetle-killed trees can create hazards for firefighters, hikers, utility providers and local infrastructure,” and notes that many of the areas most vulnerable to beetle kill are located near “densely populated communities within the Front Range foothills.”\n\nA spokesperson for the Governor’s Office did not return a request for comment before publication regarding why the news release suggests that beetle-kill trees increase fire risk, when the science and the state’s own experts don’t show that.\n\nScientists say mountain pine beetles are natural, help biodiversity\n\nBark beetles are native species that have co-evolved with specific host species of trees in the West, according to the Colorado State Forest Service. Mountain pine beetles tend to attack ponderosa pines and lodgepole pines.\n\nVeblen began researching the interaction between bark beetles and wildfires in the late-1980s, developing a technique of “tree ring reconstruction” that shows prehistoric wildfires and beetle outbreaks going back to the 1600s. He said his studies showed that regional-scale bark beetle outbreaks and high-severity wildfires are not unprecedented in the mountain West and have occurred for centuries, especially during extreme drought conditions.\n\n“If you look at the tree-ring records of fires over the last several centuries, we have not seen a significant increase in either pine beetle outbreak or fire activity, compared to the 19th century or earlier,” Veblen said.\n\nThat may be surprising since wildfires like those that occurred in 2020 in Colorado have been described as unprecedented, but the tree records show that “very large, high-severity fires” are “business as usual,” Veblen said, especially in high-elevation forests. He pointed to an example when the entire western side of what is now Rocky Mountain National Park burned in 1851, encompassing nearly all of the current zone of lodgepole pine around the town of Grand Lake.\n\nWhat is different in the 21st century is that more people live in these mountain areas and the impacts of climate change are resulting in drought conditions becoming more common and occurring with more regularity across the West, Veblen said. He noted that drought conditions also weaken trees’ defenses, making them more susceptible to beetles, and warmer winters may result in increased beetle survival.\n\n“We know warming temperatures are creating conditions that are more conducive for bark beetle outbreaks,” Veblen said. “So it’s likely that over the next several decades, we’re going to see abundant beetle activity, but it’s not completely unprecedented.”\n\n\n\nDominick DellaSala, a senior conservation scientist at the California-based Conservation Biology Institute, has studied forest ecosystems across the Western U.S., including the Rocky Mountains.\n\nThe lead author of a recent scientific paper entitled, “Removing dead trees will not save us from fast moving wildfires ,” DellaSala said the common assumption that beetle-killed trees increase wildfire risk has not been proven.\n\n“Contrary to what most people think, dead trees lose their flammable properties very shortly after they go through their needle phase,” DellaSala said. “So they have a red-phase and a gray-phase in terms of how the needles change colors. Once those needles drop out of the canopy, which is one to three years … they’re no longer flammable. There’s no live fuel in the canopy to cover a crown fire.”\n\nArend, the state Department of Natural Resources communications director, noted that while “annual burn probability is unaltered” in beetle-killed forests, “what does change is that surface fire can transition to crown fire under a wider range of environmental conditions and lower wind speeds.” He also noted when red needles are in the canopy they can have a “lower foliar fuel moisture” and “may facilitate a transition in fire type from surface to crowning under a wider range of fuel moisture conditions and lower wind speeds.”\n\nForests with dead trees are not actually dead, DellaSala said, noting that ecologists recognize that these forests have “exceptional biodiversity.” He said policies aimed at removing dead trees, such as those killed by beetles, from the landscape may hurt, rather than help, ecosystems.\n\nWhile policy makers and forest managers often see removal of dead trees as an “easy solution” that the public is generally in favor of, DellaSala said he believes that dead tree removal tends to be more focused on economics than reducing wildfire risk. He noted that companies that remove dead trees tend to want to remove trees before they start to decay and often want to remove the largest dead trees, which are the most profitable but also the most valuable to ecosystems.\n\n“Instead of just saying, ‘Hey, we’ve got economic interests,’ they cloak it in misinformation that these trees are going to all burn up and they’re contributing to fast fires,” DellaSala said. “In fact, we know that the science, much of which has been developed in the Rockies, says the opposite is the case.”\n\nArend, the state Department of Natural Resource communications director, in response to questions about the state’s beetle-kill tax incentives said, “there is positive feedback from industry partners and the number of manufacturers that apply for the exemption that they benefit from them.”\n\nThe state Department of Natural Resources claimed that salvaging beetle-killed trees and converting them into forest products “can store carbon” that would otherwise be released through decomposition or burning in a wildfire.\n\n“Mountain pine beetle outbreaks result in many dead trees, so there are both economic and ecological benefits to utilizing some of that beetle-killed wood than allowing it to decompose by turning them into forest products, and tax incentives encourage that,” Ardened said. “… Bark beetles don’t necessarily drive wildfire risk, but the dead trees can significantly add to fuel loads, and programs like this provide an incentive to remove some of this fuel from the affected forest and reduce fire intensity.”\n\nDellaSala and Veblen both questioned the efficacy of forest “thinning” and “fuel reduction” projects such as those that occur across Colorado. While these types of projects may reduce wildfire risk under some conditions, wildfires in Colorado tend to be driven by extreme fire weather — or a combination of dry conditions and high winds.\n\n“Thinning really isn’t going to work under those conditions,” DellaSala said. “You’re going to actually have more impacts on forests, especially if you don’t dispose of the slash, and you’re not going to get all of it, because it’s costly to get rid of that slash. Then you have impacts to the soil, impacts to wildlife habitat.”\n\nVeblen said that removal of hazardous dead trees that could fall near trails, campgrounds or infrastructure, “makes sense,” but that there is little evidence to support that projects focused on backcountry areas away from communities reduce wildfire risk.\n\nBoth DellaSala and Veblen noted that there is evidence showing that home hardening and creating defensible space, or buffer zones around residential properties, are the best ways to protect communities from wildfires. Both also noted that decommissioning or closing roads, which studies have shown increase the chances of wildfires starting due to human causes, could also reduce wildfire risk.\n\nThe state Department of Natural Resources also cited home hardening and defensible space as important strategies.\n\n“Hopefully people on (the Governor’s) task force will be interested in ‘Hey, this is where we can really have an impact, let’s put our resources there,’ rather than continuing to do what is sometimes referred to as paddling upstream, reducing fuels in the hope that that may prevent fires from spreading,” Veblen said.\n\nCitizens continue to raise questions\n\nHoward Brown, a resident of the Silverthorne area, first started speaking out about forest management projects in around 2015, when a mountain pine beetle epidemic decimated Summit County’s lodgepole pine stands.\n\nBrown, a former environmental policy analyst for the Congressional Research Service, said he became concerned about the U.S. Forest Service’s proposal to clear-cut a 1,500-acre area near Breckenridge and Frisco in the name of wildfire prevention. He spearheaded a petition that gathered dozens of signatures of residents opposed to the project, but the petition was unsuccessful at stopping it.\n\nDespite widespread fears that beetle-kill would increase wildfire risk, Brown said that Summit County has not seen major wildfires in the more than a decade since that previous beetle outbreak. He noted that most wildfires in the county are human-caused and suggested that banning campfires, while unpopular, would prove more effective at reducing wildfire risk than forest management like “thinning” or “fuel reduction” projects.\n\n“The threat of fire (due to beetle-killed trees) is really a red herring,” Brown said. “It’s a false pretense being used to scare people and get away with destroying the forest for very dubious purposes.”\n\nNederland resident Josh Schlossberg is the Colorado advocate for the Eco-Integrity Alliance , a grassroots advocacy organization that calls for limiting management in favor of “ecological balance” on public lands.\n\nSchlossberg referred to the widespread concern that beetle-kill will increase wildfire risk as “beetlemania.” He said he was surprised to see the Colorado government repeating the same talking points that were raised more than a decade ago, despite no evidence that the previous wave of beetle-kill increased wildfire risk.\n\n“The beetles come in and they’re doing their job and they’re being demonized,” Schlossberg said. “They’re native wildlife that have always been here that are creating that structure. Nature knows what it is doing. Nature has been here for hundreds of thousands to millions of years before the first humans set foot on this continent. We have to trust nature.”\n\nBoth Schlossberg and Brown said that they’re concerned that government leaders and the logging industry are taking advantage of the fear of wildfires to advance policies and management goals that don’t actually reduce the wildfire risk for communities.\n\nSchlossberg encouraged Colorado residents to get involved at a local level to encourage policy makers to seriously consider whether forest management projects will result in reduced wildfire risk or not.\n\n“Take your healthy skepticism and apply it to what is happening on our last best ecosystems on public lands,” Schlossberg said. “People moved to Colorado because of the ecosystems. It seems like so many Coloradans are just willing to look the other way or have not been made aware of this.”",
        "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNeDdLS2puU1h3T01ZUEJSUGJPNnlNVWt0OVVxLWM2QS1EYmZ4V25zSHJLY29xRUxsYUJ6NkN3d2xZamFNX3N3bHF0MFd5ME9qNXFOOXliUU5oaTk2QVZQRnBhMnhubm02LTkyQW1SUFRvazNSVGdmX0hiRWN5VE5Bb2lvU2xsUXV6bFB4d1RYc1A2YWkyRnlj?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 17:00:00 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "cyclone",
        "title": "The biggest snow in years is falling in the Southeast, triggering hundreds of accidents on slick roads - CNN",
        "description": "The biggest snow in years is falling in the Southeast, triggering hundreds of accidents on slick roads  CNN",
        "content": "Snow plows enter I-85 from US Highway 76 in Anderson to continue toward Greenville, South Carolina, treating the main roads in the area on Saturday. Ken Ruinard/USA Today Network/Imagn Images\n\nAs the sun set across the Southeast, state officials urged residents to stay off roads with the bomb cyclone continuing to deliver snow, ice, and dangerously cold temperatures.\n\nIt’s “best for folks to stay home,” a representative of the North Carolina Department of Transportation told CNN. The official noted the potential of black ice to form on roads, making travel particularly dangerous.\n\nRoad closures were mounting across North Carolina - including a section of I-85 northeast of Charlotte - as well as in Virginia, and other Southern states where weather warnings remained in effect.\n\n“Fewer cars on the road during winter weather will help to keep everyone safe and allow crews to perform their jobs effectively,” wrote the Virginia Department of Transportation’s Hampton Roads branch in a social media post.\n\n“This is what nightmares are made of on the roadways,” said CNN’s Derek Van Dam as he reported on the tropical storm force winds pounding Virginia Beach while snow fell.\n\nVan Dam warned that the powerful winds “will only further drop the visibilities tonight and make the treacherous road conditions that we’ve all seen,” echoing other pleas for motorists to stay indoors.",
        "link": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQX0hXWXJ4NmlkZnBvdzNYWmpKRDc1RDFwR1VaSWd4WWE1MTVqLXh4ZVhWMGNlQ09MTVYzQUNObTlKc3J2RzRodDdaZEpHN2w2MnlKLWRGQ0lfdmVrblRXWW9WY0ZDLUVqNmpPcjRCWGhVYVBneFo0dFpfdXlfWGxnN0RXZndpWkxmRXBmMjliWmxfdzU2VUdxYUtSaG8?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sun, 01 Feb 2026 02:22:00 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "cyclone",
        "title": "Live updates: Nor’easter ‘bomb cyclone’ hammers Carolinas with record snow, intense winds - FOX Weather",
        "description": "Live updates: Nor’easter ‘bomb cyclone’ hammers Carolinas with record snow, intense winds  FOX Weather",
        "content": "NWS enters the chat: ‘We don't name winter storms, period.’\n\nFOX Weather is often asked \"do winter storms get names?\" The answer is no.\n\nThe National Weather Service (NWS) and the National Oceanic and Atmospheric Administration (NOAA) do not recognize or use names given to winter storms by media outlets or private organizations in official forecasts.\n\nThe National Weather Service issues detailed forecasts and alerts to communicate specific impacts from winter storms, but we do not name them. - NWS spokesperson Marissa Anderson\n\nUnlike hurricanes, which are well-defined systems with a single clear center, winter storms are often broad, unorganized, and can have multiple centers that shift or redevelop. A single winter system can produce vastly different conditions across a region—such as a blizzard in one area and just rain in another—making a single name potentially misleading to the public.\n\nThe names you may have seen were developed without collaboration or consultation with official global weather authorities like the World Meteorological Organization (WMO) or the American Meteorological Society (AMS). Official agencies argue that naming winter storms is driven more by social media needs, such as creating hashtags, and marketing rather than sound meteorological science. The NWS has advised its forecast offices to avoid these names because they can create confusion, as the names are not used on official government warnings or safety bulletins.\n\nIn a statement to FOX Weather, the National Weather Service said, \"The NWS will name tropical systems, but does not do this unilaterally - these names are from a list established by an international committee of the U.N. World Meteorological Organization.\n\nSpokesperson Marissa Anderson told us, \"This naming is contingent upon well defined and universal criteria (eg: an organized area of low pressure with top winds of at least 39 mph). Names are given to these systems because they are discrete and naming provides a common link as these storms traverse international boundaries and multiple languages, and to distinguish between multiple storms that may threaten a region concurrently. Unlike tropical systems, winter storms are more diverse with impacts that evolve throughout the storm’s life.\"",
        "link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNcV9XVU5NQWFzR2J0V0xDOWNseWVJRnhPTW9zR1lYZWNEbWRuMExtczZUUkVYS0NhOTdnSU04RzJESWxwMVl1Zk1FUVg0ZWR4MVdMdGNDb1doWVN4ejRrU19qZ21JSUFJMmE3bHZYclhhTkJHdk53YklFX1BhNnpMb01LS0RtTVAyZzJzbHJ5NW1SY3FVMHVURkxXUE5BZG5WOTZXVnNPendhby1MQnBkNlJJZjNRNDdvR3hPdzhTRXJBM21odXN6UkNRa9IB0AFBVV95cUxNNmZoVGl4aWZzMmc1ZzdoRXhhOWhRUy05bGZEVV9BLTVyVjNWUVFRVFh0LXExcERHYXY2N3U1TTdzWDNHUk9jN01sbFdPRXZBYWxUQnlGRUJMU3c0N013Uy1xc21TYWNRM1k4a2EteVU5eDUwc1NvOHQ5cTFzMk9HVzdjYi11V1lBUi1QVjZGQ1NhVjlYSzFuazdXeE5kVENwc2FwMGNabFp6LTFxVGtYYWc1S2VqME1JYjhjdWUtUll6SmxjTXVRb3dBYk9CQjVy?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sun, 01 Feb 2026 00:10:22 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "cyclone",
        "title": "Southeast braces for 'bomb cyclone' as storm rapidly intensifies - WJCL",
        "description": "Southeast braces for 'bomb cyclone' as storm rapidly intensifies  WJCL",
        "content": "The National Weather Service said parts of the Carolinas could see snowfall rates of about 1 inch per hour.\n\nParts of the Southeast are bracing for a second winter storm in as many weeks as a fast-strengthening system spreads snow across the region and threatened dangerous travel and bitter cold.Forecasters said the storm was expected to rapidly intensify into a “bomb cyclone,” a term used when atmospheric pressure drops sharply in a short period of time. The strengthening system could bring hurricane-force winds, worsening conditions as snow continues to fall.Download the WJCL App for weather alerts: Apple, Google PlayClick here for your local forecastClick here to share your weather photos and videosThe National Weather Service said parts of the Carolinas could see snowfall rates of about 1 inch per hour. Some locations could receive unusually high totals for the region.As winds increase, officials warned of blowing snow and sharply reduced visibility. Communities along the coast could experience blizzard-like conditions.After the storm moves out, forecasters said dangerously cold temperatures will follow.States of emergency were declared in Georgia, Virginia, North Carolina and South Carolina.Below video: WJCL Meteorologist Jonathan Myers gives an update on Savannah snowfall\n\nAdvertisement\n\nParts of the Southeast are bracing for a second winter storm in as many weeks as a fast-strengthening system spreads snow across the region and threatened dangerous travel and bitter cold.\n\nForecasters said the storm was expected to rapidly intensify into a “bomb cyclone,” a term used when atmospheric pressure drops sharply in a short period of time. The strengthening system could bring hurricane-force winds, worsening conditions as snow continues to fall.\n\nThe National Weather Service said parts of the Carolinas could see snowfall rates of about 1 inch per hour. Some locations could receive unusually high totals for the region.\n\nAs winds increase, officials warned of blowing snow and sharply reduced visibility. Communities along the coast could experience blizzard-like conditions.\n\nAfter the storm moves out, forecasters said dangerously cold temperatures will follow.\n\nStates of emergency were declared in Georgia, Virginia, North Carolina and South Carolina.\n\nBelow video: WJCL Meteorologist Jonathan Myers gives an update on Savannah snowfall",
        "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBzaVVSVzkyejZqY2JnWF9xd01tZ1JoT0VFaXUxRDhpTnFyWjdteENkZ1FNa3BFd1ktaUtkRkloNjgtQmx3dnIzbS1uVFppd0tzdllBbWxta25vRERfOTVKYzVaWE1Eb2tQTWVGdGlQWUFDNW5CQVYyQk5YVGVpZw?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 19:16:00 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "cyclone",
        "title": "Cyclones Post Top-15 Ranked National Marks in Day Two - Iowa State Athletics",
        "description": "Cyclones Post Top-15 Ranked National Marks in Day Two  Iowa State Athletics",
        "content": "MANHATTAN, Kan. – Iowa State posted marks among the top 15 in the nation as Cyclones completed competition at the DeLoss Dodds Invite and John Thomas Terrier Classic.\n\nIn Boston at the John Thomas Terrier Classic, Devan Kipyego finished as the top collegian in the invite mile. Kipyego clocked 3:54.37, just off his 3:54.24 that ranks second in ISU history. Emanuel Galdino , who holds the school record (3:54.23) also broke four with 3:59.83. Among NCAA Division I runners, Kipyego currently ranks in the top 10.\n\nIn the invite 3,000m, Robin Kwemoi Bera joined Kipyego in posting the top collegiate time in his event at Boston with his finish of 7:43.87. The performance is the second fastest in school history, standing just behind Wesley Kiptoo's 2022 record of 7:43.61. Bera's time currently ranks ninth in the nation.\n\nOver at the DeLoss Dodds Invite, the women's milers went fast with Betty Kipkore leading the way with a facility and meet record of 4:37.32 (No. 4 ISU). Mercyline Kirwa finished next with 4:37.86 (No. 6 ISU) and Mercy Kibet went 4:38.43 for third.\n\nAll Cyclone hurdlers punched their tickets to the final. For the women, Riyah Burns hit a season best, while Daylin Williams , Alec Carr and Grayson Hartman hit season bests for the men in prelims.\n\nBoth women and all four men improved to hit either personal records or season bests in the final. Emma Havighurst finished second with 8.45 to again move up the all-time ISU list, this time to No. 7, while Riyah Burns went 8.50 to clock a PR and a time .01 off the ISU list. Daylin Williams , Jack Latham , Alec Carr and Grayson Williams all finished in the top seven with season bests, including Williams' 7.80 to move up to fifth in program history.\n\nRachel Joseph sprinted in her first 400m of the season, and took down the meet and facility record with 52.87 in the invite section. Joseph's time currently ranks 15th nationally. Jenna James finished third in 54.06.\n\nIn the heptathlon, Tristan Rheingans finished the seven events with 4,898 points, less than 100 off the ISU top 10. The sophomore recorded personal bests in the shot put, high jump, 1,000m and matched his pole vault PR through the two days of competition.\n\nThe meet closed with the women's 4x400m squad of James, Joseph, Makayla Clark and Emma Vorpagel going 3:37.43, producing the third-fastest performance in school history. The time took down the meet and facility record.\n\nIn total, Cyclones performed to 12 top 10-ranked program performances and won seven events on the weekend.\n\nISU will next host the Iowa State Classic Friday, Feb. 6 at Lied Rec.\n\nIowa State Results\n\nDeLoss Dodds Invite\n\nHeptathlon 60m Hurdles (M): 1. Dorian Charles, Kansas State – 8.03; 10. Tristan Rheingans , Iowa State – 8.69; 14. Cooper Spurgeon , Iowa State – 9.23\n\nPole Vault (M): 1. Payton Kasper, Kansas – 16-0 3/4 (4.90m); 9. Tristan Rheingans , Iowa State – 14-1 1/4 (4.30m, T-PR)\n\n60m Hurdles Prelims (W): 1. Sky Hagan, unattached – 8.42; 2. Emma Havighurst , Iowa State – 8.53; 3. Riyah Burns , Iowa State – 8.57\n\n60m Hurdles Prelims (M): 1. Demario Prince, Baylor – 7.72; 2. Daylin Williams , Iowa State – 7.84 (T-No. 8 ISU); 4. Alec Carr , Iowa State – 7.91; 5. Jack Latham , Iowa State – 7.93; 7. Grayson Hatman, Iowa State – 8.05\n\nTriple Jump (W): 1. Destini Smith, Kansas State – 42-2 1/4 (12.86m); 7. Ava Cinnamo , Iowa State – 40-7 (12.37m)\n\n60m Prelims (W): 1. Nayla Harris, UT_Rio Grande Valley – 7.26; 14. Brooklyn Sandvig , Iowa State – 7.73\n\nShot Put (W): 1. Dani Hartung, unattched – 54-0 (16.46m); 4. Kamari Brown , Iowa State – 49-1 1/2 (14.97m, PR); 6. Candra King , Iowa State – 47-4 1/2 (14.44m, PR)\n\n60m Prelims (M): 1. Koryee Wyatt, unattached – 6.67; 16. Mikey McClain , Iowa State – 7.19\n\nMile (W): 1. Mya Trober , Iowa State – 4:53.98; 5. McKinley Wheeler , Iowa State – 4:57.32; 6. Olivia Verde , Iowa State – 5:01.28\n\n60m Hurdles Final (M): 1. Demario Prince, Baylor – 7.72; 2. Daylin Williams , Iowa State – 7.80 (T-No. 5 ISU); 4. Jack Latham , Iowa State – 7.82; 5. Alec Carr , Iowa State – 7.89; 7. Grayson Hatman, Iowa State – 8.00\n\n60m Hurdles Final (W): 1. Sky Hagan, unattached – 8.42; 2. Emma Havighurst , Iowa State – 8.45 (PR, No. 7 ISU); 3. Riyah Burns , Iowa State – 8.51 (PR)\n\n400m (W): 1. Chloe Rodriguez, Oklahoma – 55.16; 3. Karynne David , Iowa State – 55.32 (No. 10 ISU); 9. Cameron Moon , Iowa State – 57.03\n\n400m Invite (W): 1. Rachel Joseph , Iowa State – 52.87; 3. Jenna James , Iowa State – 54.06\n\nHeptathlon 1,000m (M): 1. Chase McMullen, unattached – 2:37.72; 11. Tristan Rheingans , Iowa State – 2:48.05 (PR)\n\nHeptathlon Overall: 1. John Swabik, Kansas – 5,864; 12. Tristan Rheingans , 4,898 (PR)\n\nShot Put (M): 1. Texas Tanner, Air Force – 65-0 3/4 (19.83m); 5. Daniel Norris , Iowa State – 55-2 (16.81m)\n\n400m (M): 1. Amere Lattin, U.S. Air Force – 47.72; 3. Ty Koehnk , Iowa State – 48.73; 5. Calvin Curcija , Iowa State – 48.95; 8. Gus Langford , Iowa State – 49.13\n\n600y (M): 1. Amon Malakwen, Baylor – 1:10.50; 2. Jacoby Harmon , Iowa State – 1:10.54; 4. Jailan Sohna , Iowa State – 1:10.80; 6. Jeb Moon , Iowa State – 1:12.26\n\n1,000m (W): 1. Stephanie Brokaw, unattached – 2:42.63; 6. Kinsey Christianson , Iowa State – 2:50.76\n\nMile Invite (W): 1. Betty Kipkore , Iowa State – 4:37.32 (No. 4 ISU); 2. Mercyline Kirwa , Iowa State – 4:37.86 (PR, No. 6 ISU); 3. Mercy Kibet , Iowa State – 4:38.43 (No. 7 ISU); 5. Bella Heikes , Iowa State – 4:49.73\n\nMile Invite (M): 1. Quenton Walion, Kansas – 4:00.31; 3. Nathan Pestka , Iowa State – 4:02.31 (PR); 5. Rodgers Kiplimo , Iowa State – 4:03.27 (PR); 6. Matthew Shelly , Iowa State – 4:04.91; 8. Meshack Kimutai , Iowa State – 4:07.02; 9. Joash Ruto , Iowa State – 4:07.50\n\n4x400m (W): 1. Iowa State (James, Joseph, Clark, Vorpagel) – 3:37.43 (No. 3 ISU); 9. Iowa State B – 3:55.68\n\n4x400m (M): 1. Baylor – 3:08.25; 3. Iowa State – 3:13.96\n\nJohn Thomas Terrier Classic\n\nMile Invite (M): 1. Sam Ruthe, Nike – 3:48.88; 10. Devan Kipyego , Iowa State – 3:54.37; 20. Emanuel Galdino , Iowa State – 3:59.83",
        "link": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPU1ZVVV9xTExfWWZOYTQ1eTZ2eHBSdXRXcE1nWFBOejNHa3M5NHI4V2lmX2V5cjV5QmFNUUpJRnR1aTBDZThDNWJrVGk1dVQydmtDT0p5R3EycnB2T3pPUGdHbXRRMFRWaE1QYVh4MFFXSUNpOWJCa0g4OUFJQjVCbVZWQlMxUkFoTjBTWjloOXBIMm1pdzJlR05vRDZKdF9laVctY3Jnc3o?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sun, 01 Feb 2026 00:39:11 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    },
    {
        "event": "cyclone",
        "title": "Photos show bomb cyclone snow storm in Carolinas - USA Today",
        "description": "Photos show bomb cyclone snow storm in Carolinas  USA Today",
        "content": "Jan. 31, 2026, 3:17 p.m. ET\n\nSnow fell on the East Coast and parts of the South (including Florida!) on Saturday, Jan. 31, amid what storm meteorologists have described as a bomb cyclone, nor'easter and a blizzard.\n\nPhotos show a family sledding in Greenville, South Carolina; a fog of snow in Columbus County, North Carolina; and palm trees covered in snow in Clemson, South Carolina.\n\nAccording to the National Weather Service (NWS), a major winter storm warning is in effect from Georgia through Virginia on Saturday, Jan. 31. Heavy snow and gusty winds are forecast from the southern Appalachians in Georgia through coastal regions of the Carolinas and southeastern Virginia.\n\nOn Friday, Jan. 30, the NWS said blizzard conditions were headed for the Carolinas due to a \"rapidly intensifying coastal cyclone.\" Affected regions, including the Carolinas and parts of Virginia and Georgia, can expect heavy snow, high winds and hazardous travel conditions.\n\n\"For cities such as Charlotte, Raleigh and Greensboro, this storm could be the biggest snowstorm in decades,\" AccuWeather said.\n\nThe weather service added that snow inland could reach 8 to 12 inches, along with snow drift from winds. Near the Outer Banks, the region could encounter gusts up to 70 mph, approaching hurricane-force winds, albeit with less snow, but with warnings for coastal flooding.\n\nHere are some photos of how residents and animals are faring:\n\nSee photos of the Carolinas amid snow storm\n\nContributing: Jeanine Santucci & Eduardo Cuevas/ USA TODAY",
        "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxOdTNmV2dzU1RwRjJHcURidXJTeWhrWXRIcWowVHFNblJVM3h5cHZZNXF3VnlXbnY2LVBFRGtPSkliUF84bzlpNDhmcXRPTFlpc25LVnVSQ254SV84NkRvdmJOeko2M1BfNDI2TjZ3U3ZIbnZZdnRYc3hPOVR2VlRndVJGUTFydXZOMU9DbXdrTFUwU1piem93bkZORlptQQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "is_read": false,
        "published": "Sat, 31 Jan 2026 20:17:00 GMT",
        "location": {
            "name": null,
            "lat": null,
            "lon": null
        }
    }
]