[
    {
        "event": "flood",
        "title": "‘Homes may have to be abandoned’: how climate crisis has reshaped Britain’s flood risk - The Guardian",
        "description": "‘Homes may have to be abandoned’: how climate crisis has reshaped Britain’s flood risk  The Guardian",
        "content": "When flooding hit the low-lying Somerset Levels in 2014, it took two months for the waters to rise. This week it took two days, said Rebecca Horsington, chair of the Flooding on the Levels Action Group and a born-and-bred resident. A fierce barrage of storms from the Atlantic has drenched south-west England in January, saturating soils and supercharging rivers.\n\n“It’s déjà vu,” she said. “The stress and anxiety is palpable in the community. We’ve all been here before, we know what happens and it shouldn’t. But since 2014, the weather events are becoming more and more frequent and the rain just dumps now.”\n\nThe climate crisis is here and now and this is its face in Britain, scientists told the Guardian. But the devastating impacts are accelerating faster than the work to keep communities protected, they said: torrential winter rains are arriving 20 years earlier than climate models projected. While those forced from homes engulfed by filthy water are suffering today, a darker question is looming: will some settlements have to be abandoned?\n\nStorm Chandra, which pummelled the south-west this week, followed hot on the heels of Storms Goretti and Ingrid. New 24-hour rainfall records were set in places in Dorset, Devon and Cornwall. Setting new records is the new normal in the climate crisis.\n\nSomerset council declared a major incident on Tuesday and across the south-west homes and businesses were flooded, communities cut off, schools closed, trains cancelled and dozens of people were rescued from stranded vehicles.\n\n“These events are getting more frequent and more serious,” said Bryony Sadler, a hairdresser from Moorland, a village on the Levels. She was planning an evacuation of her family and animals when the Guardian spoke to her this week as the waters rose. “The rain is heavier and more intense, the winds stronger.”\n\nSadler is right: the science is now crystal clear that winters are getting wetter in the UK due to global heating, hitting damp regions like the south-west hardest. The reason is simple physics: warmer air holds more water vapour, meaning heavier downpours – and it is getting worse.\n\n“There’s been massive changes over the last four or five years,” said Prof Hayley Fowler, an expert on climate change impacts at Newcastle University. “We’ve seen a rapid increase in warming and that has a huge knock-on effect on rainfall. We’re already experiencing changes in UK winter rainfall that the global and regional climate models predict for the 2040s – we’re 20 years ahead.”\n\nThe extra water falling in the UK each year was equivalent to 3m Olympic-sized swimming pools, Fowler said: “That’s a lot of extra water and means that the ground is more generally saturated and more prone to flooding. That’s what we’ve seen in the south-west this week.”\n\nThe rain is also falling in more powerful bursts, with storms now 20% more intense, according to the Met Office. There was no doubt about the culprit for the deluges, said Fowler: “It’s directly attributable to fossil fuel burning and the concentration of greenhouse gases in the atmosphere. So it’s going to continue [getting worse] until we stop.”\n\nGlobal carbon emissions set another new record in 2025. The past three years are the hottest ever recorded. With no sign of the climate crisis ending any time soon, protecting communities from increasingly extreme weather is becoming ever more vital – but global heating is outpacing us.\n\nFowler is a member of the adaptation subcommittee of the Climate Change Committee, the government’s official advisers: “We are very concerned about the widening gap between the action we’re taking in the UK and the impacts we’re feeling from climate change. Flooding is actually one of the areas that we are doing better at, which is slightly horrifying given the actual impacts we’re feeling almost every week now.”\n\nHer own view is that there is not enough investment to stop flooding: “There are a lot of plans, but there’s still a lack of delivery. Without resources going into trying to make communities resilient, there’s going to be fatalities, there’s going to be economic damage.”\n\nFor the south-west, those resources were needed today, said Dr Martina Egedušević, a flooding scientist and engineer at the University of Exeter and an independent member of the Environment Agency’s South West Regional Flood Committee. “We are still funding flood protection like climate change is a future problem, but for communities in the south-west it is already here,” she said.\n\nOn the ground, that matters. Bill Revans, the leader of Somerset council and member for the ward, including Moorland village, said: “We are now more frequently reaching this point where we need to get in extra support to be able to manage the water.” That means setting up high-volume pumps.\n\n“But if that resource was there permanently, it would be a case of flicking a switch rather than having to wait for cranes and contractors and all the other difficult project planning things needed to get that operation up and running,” he said.\n\nSadler said: “We don’t get anywhere near the help we need. Help eventually comes from the government and then they forget about us until it gets bad again.”\n\nEgedušević said: “Funding is often short term and reactive. Maintenance in particular is underfunded, and flood defences only work if they are maintained and there is a growing backlog.” She also backs more nature-based solutions to complement hard defences such as the Bridgwater tidal barrier. Planting trees, blocking upland drains and slowing the flow of water downstream all helped, she said.\n\nThe south-west has always been vulnerable to flooding. “These storms coming in off the Atlantic hit the west of the country first, so Devon and Cornwall sticking out like that into the ocean bear the brunt,” said Dr Amy Doherty, the manager of the Met Office’s National Climate Information Centre.\n\nThe region also has high moors that catch the rain, steep valleys where streams can swell rapidly and many communities on rivers and coastlines, where rising sea level adds to the dangers.\n\nBut the new climate-driven intensity of rain was bringing new peril: flash floods that overwhelmed drainage, said Egedušević: “So areas historically not classed as flood prone areas are now experiencing flooding, which can catch communities off guard. The drainage systems are frequently outdated and not designed for today’s rainfall extremes.”\n\nJames Wade and his family in Taunton, now in emergency accommodation, suffered flooding for the first time this week thanks to blocked drains. “We have been here for 13 years and this has never happened before. Even during the huge floods of 2014 we were dry,” he said.\n\nRevans said: “We’ve only got so much money. As soon as you clean a drain out, it will start filling up again. I’d love to live in a world where we could maintain those drains to that high standard. But that’s not a situation that local councils are in at the moment.”\n\nJim Flory, the Environment Agency (EA) environment manager for Wessex, who has worked in incident management in the south-west for 20 years, said: “We’re trying to keep ourselves ahead of the curve. But it is very, very difficult because you’re fundamentally dealing with a very complex system being influenced by factors such as climate change.”\n\nDue to an EA funding shortfall, the number of properties to be better protected from flooding by 2027 was cut in 2025 by 40%, while 500 of 2,000 new flood defence projects were abandoned. The EA said in November it was £34m short of its expected budget.\n\nA month earlier the environmental audit committee of MPs had warned: “The scale of investment remains insufficient relative to overall flood risk. The current system, though delivering important defences, is fragmented and reactive, leaving major gaps in long-term resilience that must be urgently addressed.”\n\nThree weeks after Storm Goretti hit Cornwall and the Isles of Scilly with 100mph winds, not everyone even has their phone lines and broadband back.\n\nThe Cornwall councillor Juliet Line said: “Resilience is lacking in the infrastructure – the vulnerability of our drainage, sewerage and communications systems is being exposed more and more with each day of rain and wind.\n\nShe added: “The council is doing the best it can with limited resources and drastically reduced funding from central government. Ultimately we need a massive injection of funding to tackle these infrastructure failings to ensure we’re able to weather these storms in the future.”\n\nMark Pugh, who produces audiobooks and lives just a few miles inland from Penzance, had to drive to a layby to find mobile signal to send a message to the Guardian: “Anxiety levels are high. Like many rural and coastal communities, we are seeing the real effects of climate negligence. Some of us are now discussing how, if this is going to continue happening, are we going to cope as we get older.”\n\nBut it is not just the south-west facing ever more floods as the climate crisis bites. Environment Agency data estimates 6.3m properties in England are at risk of flooding, rising to 8m by 2050, with Wales, Scotland and Northern Ireland also hit hard.\n\nIt’s also not just the damp British Isles. “This is all very new everywhere,” Egedušević said. “Everyone [across Europe] is failing to keep pace with climate changes. We are coming into the era when we are trying to live with these things, rather than fight them 100%.”\n\nIn Somerset, that means contemplating the previously unthinkable. “It may be that in the next 50 years, perhaps in the next 20, some homes around here will have to be abandoned,” said Mike Stanton, the chair of the Somerset Rivers Authority.\n\nRevans reflected on the local impact: “It’s a beautiful community here, tight-knit. Everyone’s really friendly and supportive of each other. They don’t deserve this.”\n\nCan communities like Moorland survive? “That’s an interesting question, isn’t it?” Revans said. “I would fight tooth and nail to be able to keep communities like this viable and going in the future. But ultimately, it’s a question of whether we’re prepared to spend the resource on keeping them dry every winter.”",
        "link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPQzBpZy02X1NwRTZ5OG91bHo4UDNpZm1Fem81V0lxS184TS1IYmhZQlVLYWV4WEJ5WjRNaWtXQXlndS1mMG5TdU92TjFBcy10aElxbktUbHZySzF3amtjVFdXLWp3bFk4WEZMVlBhbjZZX1dqbVg4RE85SUpKOU9SQkhHekdmd0UtdmllSXFSZkRxSzhISHg3bw?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 06:00:00 GMT"
    },
    {
        "event": "flood",
        "title": "Water main break in Morrisania floods roads; DEP crews investigate source - News12 | Bronx",
        "description": "Water main break in Morrisania floods roads; DEP crews investigate source  News12 | Bronx",
        "content": "Be the first to know\n\nTopics you care about, straight to your inbox",
        "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxPMVJubGt4SktMaFhsOGp5Q045OUQtOTJ2Yks5aEY5WXk4Q2l3andtLV81MG5vQTJGMUszbXlVWWNkSGZiOVVMaTlTMGNab1lrRTlzdXluMjcyTENOcG5oSl9fZENwY1NrMDF4ZmtTelE4dE04V0J1UXd0VllIZkswSzdtVmJWeEp0UUF4LVdXOWhQRllsWDFoOFh4b0NrQQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 05:37:30 GMT"
    },
    {
        "event": "flood",
        "title": "Update: Coastal flood advisory affecting 4 Massachusetts counties Sunday and Monday - MassLive",
        "description": "Update: Coastal flood advisory affecting 4 Massachusetts counties Sunday and Monday  MassLive",
        "content": "An updated coastal flood advisory was released by the National Weather Service on Saturday at 1:16 a.m. valid from Sunday 8 a.m. until Monday 2 p.m. for Essex, Suffolk, Norfolk and Plymouth counties.\n\nThe weather service comments, \"One to two feet of inundation above ground level expected in low-lying areas near shorelines and tidal waterways (10.8 to 12.7 feet Mean Lower Low Water).\"\n\n\"Shallow pockets of flooding less than one foot deep affects the lowest lying areas along the coast, including Morrissey Boulevard in Boston. Most roads remain passable. Flooding up to one foot deep affects coastal roads on the North Shore from Salem to Gloucester and Newburyport. Rough surf will cause flooding on some coastal roads around the time of high tide due to splashover,\" says the weather service. \"If travel is required, allow extra time as some roads may be closed. Do not drive around barricades or through water of unknown depth. Take the necessary actions to protect flood-prone property.\"\n\nYour guide to weather alerts: advisories, watches, and warnings\n\nFlash flood warning: Take action!\n\nA flash flood warning is issued when a flash flood is either imminent or already occurring. In flood-prone areas, it's crucial to move immediately to higher ground. A flash flood is a sudden and violent inundation that can develop within minutes to hours, and it can even happen in areas not currently experiencing rainfall.\n\nFlood warning: Take action!\n\nA flood warning is issued when flooding is imminent or occurring.\n\nFlood advisory: Be aware:\n\nA flood advisory is issued when flooding is not expected to be bad enough to issue a warning. However, it may cause significant inconvenience, and if caution is not exercised, it could lead to situations that may threaten life and/or property.\n\nFlood watch: Be prepared:\n\nA flood watch is issued when conditions are favorable for flooding. It doesn't guarantee that flooding will occur, but it signifies that the possibility exists.\n\nBe flood-ready: Expert guidance from the weather service for your safety\n\nIn flood-prone regions or while camping in low-lying areas, understanding and following the weather service flood safety guidelines can be a lifesaver:\n\nSeek higher ground:\n\nIf you're in a flood-prone area, or if you're camping in a low-lying spot, move to higher ground as a first step.\n\nAdhere to evacuation orders:\n\nIf local authorities issue an evacuation order, heed it promptly. Prior to leaving, secure your home by locking it.\n\nDisconnect utilities and appliances:\n\nIf time permits, disconnect your utilities and appliances. This precaution minimizes electrical hazards during flooding.\n\nSteer clear of flooded basements and submerged areas:\n\nAvoid basements or rooms submerged in water with electrical outlets or cords. Preventing electrical accidents is crucial.\n\nSwift evacuation for your safety:\n\nIf you notice sparks or hear buzzing, crackling, snapping, or popping sounds, evacuate without delay. Do not enter water that may carry an electrical charge.\n\nStay away from floodwaters:\n\nNever attempt to walk through floodwaters, even if they appear shallow. Just 6 inches of fast-moving water can forcefully sweep you off your feet.\n\nSeek higher ground when trapped:\n\nShould you become trapped by moving water, reach the highest point possible and dial 911 to contact emergency services.\n\nDuring heavy rainfall, there is a risk of flooding, especially in low-lying and flood-prone areas. Remember to never drive through water on the road, even if it seems shallow. According to the weather service, as little as 12 inches of rapidly flowing water can carry away most cars. Stay safe by being prepared and informed.",
        "link": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOOXJsVkkxWG9KWmFSdVBtMWxlNFYzTXpyUjNNWnRUNlFxdjJ1NmI0cHFFUmZlWkJKS25QbkdfX3B4aU55WjFXTXQ2a0FzSk0tU2RtYWlidF9MNFJFbWtsSWtGdWE0X3l6d0JnSEppSUQ4VGZ5VXVLOGFhVWFLLU5HLXNoOHlNVzF4ajBRVTZrX2tlVWp1eWVzMHNIbnpjLWF6Yk9MbnhUNmdjMkFOd2VoNzVPeFIyaXNjbFF1aTRFMGhxUWF3SWJr?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 06:13:00 GMT"
    },
    {
        "event": "flood",
        "title": "Orlando City Council approves flood mitigation project for Richmond Heights - Spectrum News 13",
        "description": "Orlando City Council approves flood mitigation project for Richmond Heights  Spectrum News 13",
        "content": "ORLANDO, Fla. — The Orlando City Council has approved a flood mitigation project for the Richmond Heights community, an area residents say has dealt with repeated flooding during heavy rain and major storms.\n\nWhat You Need To Know\n\nOrlando City Council approved more than $12.5 million for a flood mitigation project in Richmond Heights\n\nThe project is funded through the Community Development Block Grant Disaster Recovery program\n\nCity officials say the neighborhood was prioritized after flooding during Hurricane Ian\n\nThe project aims to reduce standing water and surface flooding by increasing drainage capacity\n\nThe project is funded through the Community Development Block Grant Disaster Recovery (CDBG-DR) program and was approved during Monday’s City Council meeting. The Richmond Heights flood mitigation project is valued at more than $12 million.\n\nCity officials say Richmond Heights was prioritized after severe flooding during Hurricane Ian exposed drainage issues in the neighborhood.\n\n“The Richmond Heights priority came from Hurricane Ian,” said Corey Knight, Director of Public Works for the City of Orlando. “During Hurricane Ian, most of the neighborhood had a lot of flooding.”\n\nResidents say flooding has repeatedly made it difficult to leave their homes and has caused damage to property.\n\n“The rain makes it flood over,” said Richmond Heights homeowner Barbara Hoosier. “The canal floods over. And it comes into my backyard. It came up on the shed, and everything that I had in the shed was damaged.”\n\nNeighborhood leaders say the flooding affects multiple streets and homes throughout the community.\n\n“It looks like you need a boat,” said Dionne Turner, president of the Richmond Heights Neighborhood Association. “It looks like up to your thigh type of water where you can’t get out of your house and nobody can really get in unless they have a boat.”\n\nCity officials say the project will focus on increasing the capacity of the stormwater drainage system to reduce standing water and surface flooding, particularly in low- to moderate-income neighborhoods.\n\n“These CDBG-DR projects are specifically for low- to moderate-income areas,” Knight said. “We’re hoping to reduce the amount of ponding and surface water that can affect those areas around there.”\n\nCity officials say the Richmond Heights project is now in the design phase, with construction timelines determined later.",
        "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZG1QUERSYXdnd2VPVkdMSnVTZXNQSjZ1WDVBUTN6NDBJZUVIeXBtQTVRNWhRcVFDdzJ1emVsb3dqWWxpRDBPWG5fQzNrM0s1M3diQ3ZIRlhuTlF3YXBOMzNPOVJsME9vY3ZGSDB3RlZCaXNzaW1yMDRWS3lMZm5OSE1nSF9XR3l0?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Fri, 30 Jan 2026 23:15:00 GMT"
    },
    {
        "event": "flood",
        "title": "Tucsonans flood the streets for national protest - The Daily Wildcat",
        "description": "Tucsonans flood the streets for national protest  The Daily Wildcat",
        "content": "January 30 saw thousands of protestors take to the streets of Tucson as well as many local businesses closing their doors as a part of a nationwide “no school, no work, no shopping” walkout protest. Participants flooded the streets as they marched to the Federal building and then around downtown Tucson. Major cities across the U.S. also participated as an extension of the protests happening in Minneapolis.",
        "link": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPX1dDZFR1eFh0cTNLbnc0b0V0WnR2U2ZUTHB0S3gwZDF5Ni1jSnVwV3RBM0NuZW12aTlGQi0xYnRwUUFoYzNNM0pXcjQxLTN4YlVua0RVWW1KNU0wOEFXdVhVVl9YZ044MW96dVBEa29kSTI3MjhpUGh3WnlZWmtETHQtY0pNUWRYa3lpUTNkVGtVRHBfU0p4ZG81MA?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 03:47:06 GMT"
    },
    {
        "event": "earthquake",
        "title": "Map: 2.4-Magnitude Earthquake Reported in New Jersey - The New York Times",
        "description": "Map: 2.4-Magnitude Earthquake Reported in New Jersey  The New York Times",
        "content": "Source: United States Geological Survey | Notes: Shaking categories are based on the Modified Mercalli Intensity scale. When aftershock data is available, the corresponding maps and charts include earthquakes within 100 miles and seven days of the initial quake. All times above are Eastern. Shake data is as of Friday, Jan. 30 at 3:59 p.m. Eastern. Aftershocks data is as of Saturday, Jan. 31 at 12:43 a.m. Eastern.",
        "link": "https://news.google.com/rss/articles/CBMiggFBVV95cUxONEJhYVhQdGNNNllMTUkwSFBaNWR5T2g0Y1VRWDRrRXRDU21PVU1HVllQNlQ1YTEwaDdUUDBuYkRKdU95S2V5ZWJEbGFDMFBLWC02MGJpbHhSZnBxTVNzNkNURzhBLWhWT2xNbkxOSlVyWDVzdjZ4OXl2SGVCdFQ5S0h3?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 05:55:30 GMT"
    },
    {
        "event": "earthquake",
        "title": "USGS: Magnitude 2.4 earthquake shakes parts of western NJ - News12 | New Jersey",
        "description": "USGS: Magnitude 2.4 earthquake shakes parts of western NJ  News12 | New Jersey",
        "content": "Be the first to know\n\nTopics you care about, straight to your inbox",
        "link": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOTlB3Z254VFNyUXpRazl3bXBSNTVFd2JzSW52M0Z5MC1qSVk2b0ZTTUttbzBybUo1LUFDWlVYME9VZ2laUTdERXF6TnRlTUFJNFV4a0YxYlVlTk1LZTltdjBPSE5JNDRHMUt6V1gzdmtVZnRyNHdGWE1IQ0NrUmVLUzF0LWhoMW5YWVIxNQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 03:45:29 GMT"
    },
    {
        "event": "earthquake",
        "title": "NJ earthquake: 2.4 magnitude quake felt in New Jersey, USGS says - ABC7 New York",
        "description": "NJ earthquake: 2.4 magnitude quake felt in New Jersey, USGS says  ABC7 New York",
        "content": "WHITEHOUSE STATION, New Jersey (WABC) -- A minor earthquake was reported in New Jersey on Friday afternoon.\n\nThe 2.4-magnitude earthquake was reported near Whitehouse Station, New Jersey, in Hunterdon County.\n\nFew other details were known.\n\nThe USGS does not consider earthquakes at 3.0 and below to be very dangerous or damaging.\n\nNew Jersey has seen a number of earthquakes in the past two years, beginning with a 4.8 centered in northern New Jersey in April 2024 that rattled the area with reports of at least 10 aftershocks.\n\nLast August, the USGS reported a magnitude 2.7 earthquake northwest of the city near Hillsdale, New Jersey.\n\nIt came days after a small earthquake could be felt across the region. That event had a magnitude of 3.0 and hit in the New Jersey suburb of Hasbrouck Heights.\n\nColumbia University professor Dr. James Davis told Eyewitness News back in August:\n\n\"It's not that rare and one thing that we do have that's quite different than out West is our crust is very old, so we feel earthquakes more intensely and from farther away for a given size,\" Davis said. \"So if they are comparing to a magnitude 4 that they get or a magnitude 3, there tends to be more shaking here for the same amount of magnitude, and it's felt much more widely.\"\n\nThis is breaking news. This story will be updated as more information becomes available.\n\n----------\n\n* Get Eyewitness News Delivered\n\n* More New Jersey news\n\n* Send us a news tip\n\n* Download the abc7NY app for breaking news alerts\n\n* Follow us on YouTube\n\nSubmit a tip or story idea to Eyewitness News",
        "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNdEc3aFZ1SFpiWG5VXzJsZHpYaFhZb01aNE9jR19Sc3RsSmZrSE1sYVRBOENtX0JZZEpDSVUxNWFlWjdkdDQtRlg3Rnh5aENKd2RNaEN6NVVqNnpwVlI0RlZOUEZhRWJIamlOWVprc3BMMlI2Y0cySVMwZlRoeF9IRzRfWHNqVkxYYzlhbUtfVHdvZkFVclh30gGcAUFVX3lxTE80eTRXSTNub2dUTmJ4QUNTV1hpUFA1dGtFNTJIV1FDWVpaSnpqOTNwTTBjNm1SWDdoend5S2FJM1ZGSWM4cnZUclhQZlRmQU5EVnA3SG5DUC1SUHdWWUJ1NzNhTHJiV0I0Zzh6eVRSRHRyaG9yVkV1T21HR0t0RGJOTmRqR0x3UVlOYkRjbU1WbE1MTG9FSTVWMmR6ag?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Fri, 30 Jan 2026 21:43:03 GMT"
    },
    {
        "event": "earthquake",
        "title": "3.4 magnitude earthquake shakes Bay Area - San Francisco Chronicle",
        "description": "3.4 magnitude earthquake shakes Bay Area  San Francisco Chronicle",
        "content": "3.4 magnitude earthquake shakes Bay Area  San Francisco Chronicle",
        "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNNEppeTc0ZnExbVBZUGZLT1BtYmlZU3B2TzBwMzlJLV9JZU5TOUJ1eVBmajctUHFMRm5hUjhxSkdEd3ktZklaRGhva05wdnQ0Y3hqbUFTN2N6RlNvS1lfZ3RvRUZjUi1yeUZKNWhBZUp1clE1dFNWOEJzZUJUVWxHWnpBYmxHWEE?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Fri, 30 Jan 2026 21:45:00 GMT"
    },
    {
        "event": "earthquake",
        "title": "World Earthquake Report for Friday, 30 January 2026 - Volcano Discovery",
        "description": "World Earthquake Report for Friday, 30 January 2026  Volcano Discovery",
        "content": "MRCCI continues vocational training programs for youth to support post-earthquake rehabilitation\n\nEleven Media Group Co., Ltd · Saturday, Jan 31, 2026 | 36 mins ago · EARTHQUAKE\n\nThe Mandalay Region Chamber of Commerce and Industry (MRCCI) is continuously providing various vocational training courses for the youth for the purpose of post-earthquake rehabilitation, according to sources. The Union of Myanmar Federation of Chambers of … The Mandalay Region Chamber of Commerce and Industry (MRCCI) is continuously providing various vocational training courses for the youth for the purpose of post-earthquake rehabilitation, according to sources. The Union of Myanmar Federation of Chambers of Commerce and Industry (UMFCCI) and the Mandalay Region Chamber of Commerce and Industry (MRCCI) jointly organized the advance computer office course graduation ceremony on January 29 at the MRCCI office in Mandalay, where 28 trainees graduated. \"Today's training is aimed at helping businesses recover after the earthquake. We are helping businesses that are having difficulty recovering after the earthquake. The biggest challenge we are facing right now is human resource issues. Many businesses are facing this issue during the relocation process. MRCCI's mission is to help businesses run smoothly. Therefore, UMFCCI and MRCCI are working together to provide training to businesses in the human resources they need and help entrepreneurs …Open article\n\nAdaptive Surface-Borehole Seismic Profile Matching and Tying Using BiGRU: A Case Study of Ultra-Deep Zero-Offset VSP in the Tarim Basin - Applied Geophysics\n\nSpringer · Saturday, Jan 31, 2026 | 1 hour ago · EARTHQUAKE\n\n* Zhao B., Yong X., Gao J., Chang D., Yang C., & Li H. Progress and development direction of PetroChina intelligent seismic processing and interpretation technology. China Petroleum Exploration, 2021, 26(5): 12-23. Google Scholar * Zhao, L., Ma, J., LI, K., … * Zhao B., Yong X., Gao J., Chang D., Yang C., & Li H. Progress and development direction of PetroChina intelligent seismic processing and interpretation technology. China Petroleum Exploration, 2021, 26(5): 12-23. Google Scholar * Zhao, L., Ma, J., LI, K., Zhu, J., Gao, Z., He, Z., & Geng, J. (2023). Seismic rock physics characteristics and modeling of ultra-deep carbonate reservoirs. Chinese Journal of Geophysics, 66(1), 16-33. Google Scholar * Hardage, B. A., 2000, Vertical seismic profiling: Principles, 3rd ed.: Elsevier. Google Scholar * Stewart, R. R., P. D. Huddleston, and T. K. Kan, 1984, Seismic versus sonic velocities: A vertical seismic profiling study: Geophysics, 49, 1153-1168, doi: https://doi.org/10.1190/1.1441745. Article Google Scholar * Zong, J., Chen, Y., Lu, C., Hu, G., & Wo, Y. (2022). Structure-oriented mapping of the subsalt fractured reservoir by reflection layer tomography from a perspective of the zero-offset vertical seismic profiling. IEEE Transactions on …Open article\n\nMock drill on earthquake preparedness conducted at Jagiroad College\n\nThe Sentinel Newspaper · Saturday, Jan 31, 2026 | 1 hour ago · EARTHQUAKE\n\nJAGIROAD: A comprehensive mock drill on earthquake preparedness was conducted on Friday at Jagiroad College in Morigaon district by the NDRF, 1st Battalion, Patgaon, in collaboration with the District Disaster Management Authority (DDMA), Morigaon, and SDRF, … JAGIROAD: A comprehensive mock drill on earthquake preparedness was conducted on Friday at Jagiroad College in Morigaon district by the NDRF, 1st Battalion, Patgaon, in collaboration with the District Disaster Management Authority (DDMA), Morigaon, and SDRF, Morigaon. A 25-member team of NDRF, led by Inspector Indramohan Singh with Sub-Inspector Kamal Rana as the second-in-command, carried out the exercise. The drill simulated an earthquake scenario, during which rescue and evacuation operations were undertaken to safely evacuate college students who were shown to be trapped inside classrooms following the tremors. An additional fire incident was also simulated as part of the exercise. Firefighters actively participated and demonstrated prompt response measures to control the fire, highlighting inter-agency coordination during multi-hazard situations.Open article\n\n25 years on, Kutch returns to quake-resistant 'bhunga' structures | Mint\n\nmint · Saturday, Jan 31, 2026 | 2 hours ago · EARTHQUAKE\n\nSince the 2001 quake, Kutch has embraced the traditional round, mud 'bhunga' houses, which can withstand tremors and winds Twenty-five years ago on the morning of 26 January 2001, Gujarat was rocked by a 7.7 magnitude earthquake, its intensity touching … Since the 2001 quake, Kutch has embraced the traditional round, mud 'bhunga' houses, which can withstand tremors and winds Twenty-five years ago on the morning of 26 January 2001, Gujarat was rocked by a 7.7 magnitude earthquake, its intensity touching \"extreme\" on the Mercalli intensity scale. With the epicentre near Chaubari village in Bhachau taluka of Kutch, the quake caused widespread destruction in the region. The National Institute of Disaster Management pegged casualties at 13,805, with more than 90% homes destroyed in Kutch. People still carry its scars within them. \"I was a witness to the tragedy. There was no precedent to that kind of devastation in my living memory,\" says Kiran Vaghela, an engineer and archaeologist, and a resident of Bhuj. \"But what happened thereafter is important. The way Kutch rebuilt itself was truly inspiring.\"Open article",
        "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNbktMQ3oybEVWODJKTWp1dGZJVS10VG9JWFQ5Q29tREktaFZGbmFQdDdCdGxkeG43OGx2RGptQ1NKTjJ3ci1ndE1ua3REWTdVT2VQekkwRWxDOFZyZ043cDFXYzYzRWdGeHR5MTZlWWg4eUNVd0ZzbFVNLWxITFNMbDA1dWd6YWZlZzhVdjFxdUZ3OTJLSjUwNk1acWtZQkp0ZEdVRUFVQTBKNFpaUjU1Tw?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 00:56:15 GMT"
    },
    {
        "event": "wildfire",
        "title": "NM congressional delegation calls on FEMA wildfire claims office leader to resign - Source New Mexico",
        "description": "NM congressional delegation calls on FEMA wildfire claims office leader to resign  Source New Mexico",
        "content": "NM congressional delegation calls on FEMA wildfire claims office leader to resign  Source New Mexico",
        "link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPR2tpVnV3OW9PbmItZndNaWVoaGd1UWF3VVVIZlJJd2JpdTFQN2tRUDBxRW56Mmxscl9EN1VYRWlSeGV1a2NhamRuV05rZ3p1Sy1OcV9GbVpRcnpMV01waksyd3RveXF1eVc4WHBqOW5VMUY5cUh0Y3BqbGU5RVEzT0xqdzUyaUFGcXNGMGFBZ3ltSGNrMk50eGYtTk1iR3BqcUFNZFQyMy1lZTJmTGxj?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 01:01:42 GMT"
    },
    {
        "event": "wildfire",
        "title": "Hawaii Supreme Court hears insurance appeal in Maui wildfire settlement - Hawaii News Now",
        "description": "Hawaii Supreme Court hears insurance appeal in Maui wildfire settlement  Hawaii News Now",
        "content": "HONOLULU (HawaiiNewsNow) - Maui wildfire survivors are waiting for a ruling from the Hawaii Supreme Court that would clear the way for the release of billions in settlement dollars.\n\nHawaii justices heard arguments on Tuesday regarding an appeal by insurance companies challenging a more than $4 billion global settlement. The settlement includes Hawaiian Electric, the state and county, with payments originally scheduled last year.\n\nKathy Sicard, 64, lost her home at Hale Mahaolu Eono in Lahaina during the 2023 Maui wildfire disaster. She watched the hearing online twice, becoming more frustrated each time.\n\n“This is outrageous. It needs to stop,” said Sicard. “I feel really upset that the insurance carriers and their legal representation are putting a pitch fork in the backside of all those involved in this horrific litigation.”\n\nSicard misses her neighbors who didn’t survive the fire, including Buddy Jantoc, whom she called one of her favorites.\n\nInsurance companies defend appeal\n\nAdam Romney, attorney for the insurance companies, said his clients want to resolve all claims.\n\n“We got the message. We understand that everybody wants global resolution. They truly want to resolve all of the claims,” Romney said. “We are not trying to stop that.”\n\nTerry Revere, representing wildfire victims, criticized the insurance companies’ actions.\n\n“They know if the class settlement goes away. Then the whole thing goes away. That is why they are trying to throw monkey wrenches again,” Revere said.\n\nSurvivors move forward despite delays\n\nSicard now lives in a one-bedroom apartment at the Hualalai Elderly Housing in Kona. Despite the ongoing legal battle, she said she’s building a new life and enjoying the surrounding beauty.\n\n“I’m in a good place no matter what happens,” said Sicard.\n\nShe said Ali’i Drive by the seaside reminds her of Lahaina.\n\nAbout 21,000 victims are included in the global settlement. The high court did not say when it would issue a ruling, although it ruled quickly the first time it heard an appeal from the insurance companies.",
        "link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOckY3Q25scm56QjhSaEVNSUhQdElieU1VeVdFRmM2eFVSbTdnaGd0RWpIa0ltaHJaX3VYY08tU2ZoNEU0d2RfM3BuQ0Z2VG9DV3Zvc2puMi1lWW5pWkpUcmVRdTlZb2hiaGgyQi1yd2JtaDNYVk9nR0lXUG1BdVBlbTdFM0Nsb2JKVUNwdWhlZUdVSHVpZEdUdVNLdDd4YTlzczU2ODA2ZDl4YWxNRWdB?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 03:43:00 GMT"
    },
    {
        "event": "wildfire",
        "title": "Breaking: New wildfire reported in Los Angeles County on Jan. 30 - Sacramento Bee",
        "description": "Breaking: New wildfire reported in Los Angeles County on Jan. 30  Sacramento Bee",
        "content": "Breaking: New wildfire reported in Los Angeles County on Jan. 30  Sacramento Bee",
        "link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5OTkpvaldvVDFETWVWdmhoU0tITmdEN29UaUpsMWVNU2VfOENJQi1oMG5WM0szeFkwT1d6LTYzemhGN200SFBWM21PekVxSGhTZXdKNTdkTE1VcTJlV18weXY5TjNxbnRjSzZmQl93R2VlSFc0?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 02:15:46 GMT"
    },
    {
        "event": "wildfire",
        "title": "Breaking: New wildfire reported in Los Angeles County on Jan. 30 - San Luis Obispo Tribune",
        "description": "Breaking: New wildfire reported in Los Angeles County on Jan. 30  San Luis Obispo Tribune",
        "content": "Breaking: New wildfire reported in Los Angeles County on Jan. 30  San Luis Obispo Tribune",
        "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTE82Vm5JUUR6TFdqVGx1cldhaG9adW5Ma3hBTGhQSHVGclpmalJWck84Ty1reWRzbDVmNFROc0hNVjFvWExQZFIxWGhrN2diUmNHeGdRRTZoTHcxSjBWVmtERjVVM0hfdFdIQWVFY1dXWnVsY2x0Q0dGUU1UWmdBQQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 05:19:02 GMT"
    },
    {
        "event": "wildfire",
        "title": "Breaking: New wildfire reported in Los Angeles County on Jan. 30 - Fresno Bee",
        "description": "Breaking: New wildfire reported in Los Angeles County on Jan. 30  Fresno Bee",
        "content": "Breaking: New wildfire reported in Los Angeles County on Jan. 30  Fresno Bee",
        "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBDbFUyelFnZC1zWmdOZ2NCY1JYeE1GRWdfdFlEU29Pek1QMTFoYlYta25NTHdXY3B1UzVPbjhUWXJVV0pDUjdZOVNQZE94QVhua29Vc29kVnc1U25nT0NvYXM2anJIazhIb1FwUnNwNEtVNk1udnVXcg?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 02:59:02 GMT"
    },
    {
        "event": "cyclone",
        "title": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C. - The Washington Post",
        "description": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C.  The Washington Post",
        "content": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C.  The Washington Post",
        "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOVndZMUd4WC1sQkFiZDhYSUJaY3JyOTU4WjA4alB6azJudTYxdlcxazFmbmw4UGYtajl0Z0RwdVdsRWt1NWw1WHl6QVVDZDU2UFVqMzlKYVRMTF9UeUt4a2VGRE10b19TT19YMWQzT0dERTVNU1VSWm5TZ0FHeUIxV1NkQ1Jrc3RPdXZJLWJTcVB1MTEwOE5QcDlR?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 04:43:20 GMT"
    },
    {
        "event": "cyclone",
        "title": "How close will bomb cyclone get to Maine? Update on track of coastal storm - WMTW",
        "description": "How close will bomb cyclone get to Maine? Update on track of coastal storm  WMTW",
        "content": "Advertisement\n\nHow close will bomb cyclone get to Maine? Update on track of coastal storm\n\nMaine is in a mostly dry and bitterly cold weather pattern right now, but a bomb cyclone that is developing in the Atlantic is generating a lot of headlines.The exact track of the coastal storm will determine how much of an effect, if any, it will have on Maine and the rest of New England this weekend.For several days, forecast models hinted that the system might swing close enough to Maine to pose a threat of heavy now.As of Friday, the trend has shifted farther east and most guidance now has the storm offshore and out to sea by the time it approaches Sunday evening.Maine's Total Weather said that unless there is a major shift in the storm's path, which is unlikely at this point, Maine will escape major impacts from the storm.There will be some clouds near the coast, but most of Maine should stay dry.Even though Maine looks to have escaped this storm, bitter cold and biting wind chills will grip the region through Sunday.Maine's Total Weather expects temperatures to moderate a bit by early next week, which will offer a brief break from the deep freeze.About Maine's Total WeatherMaine's Total Weather forecasts have been certified most accurate in the Portland market nine years in a row by WeatheRate.The Maine's Total Weather team consists of chief meteorologist Roger Griswold, meteorologist Ted McInerney, meteorologist Colleen Hurley, meteorologist Victoria Wisniewski, and Emily Pike.Maine's Total Weather helped WMTW Channel 8 win the 2025 Maine Association of Broadcasters (MAB) Award for Best Weathercast.\n\nMaine is in a mostly dry and bitterly cold weather pattern right now, but a bomb cyclone that is developing in the Atlantic is generating a lot of headlines.\n\nThe exact track of the coastal storm will determine how much of an effect, if any, it will have on Maine and the rest of New England this weekend.\n\nAdvertisement\n\nFor several days, forecast models hinted that the system might swing close enough to Maine to pose a threat of heavy now.\n\nAs of Friday, the trend has shifted farther east and most guidance now has the storm offshore and out to sea by the time it approaches Sunday evening.\n\nHearst Owned\n\nMaine's Total Weather said that unless there is a major shift in the storm's path, which is unlikely at this point, Maine will escape major impacts from the storm.\n\nThere will be some clouds near the coast, but most of Maine should stay dry.\n\nHearst Owned\n\nEven though Maine looks to have escaped this storm, bitter cold and biting wind chills will grip the region through Sunday.\n\nMaine's Total Weather expects temperatures to moderate a bit by early next week, which will offer a brief break from the deep freeze.\n\nAbout Maine's Total Weather\n\nMaine's Total Weather forecasts have been certified most accurate in the Portland market nine years in a row by WeatheRate.\n\nThe Maine's Total Weather team consists of chief meteorologist Roger Griswold, meteorologist Ted McInerney, meteorologist Colleen Hurley, meteorologist Victoria Wisniewski, and Emily Pike.\n\nMaine's Total Weather helped WMTW Channel 8 win the 2025 Maine Association of Broadcasters (MAB) Award for Best Weathercast.",
        "link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPSkxUT2NzRmdiYzZoR05mYnZVRWIwYlVEamRiTGg4OXAtVld0OXlqUmYtYWVmWVJNY2VUaVUweklxTFJkYXFXbWZaMXAyUXV5eXNjV3pFOXBxVG8yYXllY29LN05KOTl6NTFodWxIZW9jcUk3eVhISHpIR1hBdE15SQ?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 01:50:00 GMT"
    },
    {
        "event": "cyclone",
        "title": "Bomb cyclone may form near the North Carolina coast | What to know about bombogenesis - WXII",
        "description": "Bomb cyclone may form near the North Carolina coast | What to know about bombogenesis  WXII",
        "content": "Advertisement\n\nBomb cyclones and winter storms | What to know about bombogenesis\n\nA bomb cyclone is an area of low pressure that shows rapid development within 24 hours between the tropical latitudes and the polar regions. The technical meteorological term for this is bombogenesis: the criteria for a bomb cyclone is a 24 hour pressure drop of at least 15-24 millibars depending on latitude. A bomb cyclone may form near the North Carolina Outer Banks While there is a chance rapid intensification may happen with the upcoming weekend winter snowstorm, it's more likely that a bomb cyclone would form once the low is near the Outer Banks and over the Atlantic Ocean. The WXII 12 First Warning Weather team agrees that there is a great deal of uncertainty with this winter storm setup, but bigger impacts from snow and wintry mix are expected along North Carolina's coast than inland based on the current forecast. There is also a concern about whether the low tracks closer to the East Coast and moves north as bombogenesis happens; this resolution would affect larger areas of the Mid-Atlantic. We do have growing confidence in snowfall potential, with lower confidence for potential snowfall amounts in North Carolina. Clash of cold and warm air masses When warmer air coming out of the Gulf clashes with cold air rolling out of the Arctic, as is the case with this weekend's storm, bombogenesis may occur. This typically happens as the low-pressure system also interacts with ocean water creating a much more powerful storm that could become a Nor'easter. This rapid intensification can lead to huge snowfalls, flooding and massive travel delays to regional shutdowns due to the severity of weather impacts.Strong wind gusts, heavy precipitation potential at the coast What a bomb cyclone might do for the Piedmont Triad is create a tight pressure gradient causing higher winds for Central North Carolina. This may lead to power outages as small trees and branches could come down on power lines. There is also potential for coastal flooding and heavy snowfall and wintry mix closer to the coast. Bombogenesis has been captured on satellite images in previous winters like this one from 2018, one of the strongest bomb cyclones on record for the East Coast. The storm dropped 53 millibars in less than 24 hours, brought coastal flooding to New England, more than a foot of snow to Boston and hurricane-force winds of 76 mph to Nantucket.Find out more here on the infamous northeast bomb cyclone of 2018.Bomb cyclones are also responsible for severe weather along the West Coast. This image shows a bomb cyclone about to bring devastating high winds and flooding to the Pacific Northwest. The image was captured by the GOES 17 West satellite using instruments to show day and night images with color imagery for the day and multispectral blended infrared for nighttime images. Find out about Friday evening storm conditions with Meteorologist Michelle Kennedy here.More weather coverage: Weather Alerts | Closing and delays | Latest weather forecast | Post pictures to the uLocal North Carolina Facebook Group | Traffic information | Report closings and delays | SkyCams | Download the WXII12 News mobile app\n\nA bomb cyclone is an area of low pressure that shows rapid development within 24 hours between the tropical latitudes and the polar regions. The technical meteorological term for this is bombogenesis: the criteria for a bomb cyclone is a 24 hour pressure drop of at least 15-24 millibars depending on latitude.\n\nA bomb cyclone may form near the North Carolina Outer Banks\n\nAdvertisement\n\nHearst Owned\n\nWhile there is a chance rapid intensification may happen with the upcoming weekend winter snowstorm, it's more likely that a bomb cyclone would form once the low is near the Outer Banks and over the Atlantic Ocean.\n\nThe WXII 12 First Warning Weather team agrees that there is a great deal of uncertainty with this winter storm setup, but bigger impacts from snow and wintry mix are expected along North Carolina's coast than inland based on the current forecast. There is also a concern about whether the low tracks closer to the East Coast and moves north as bombogenesis happens; this resolution would affect larger areas of the Mid-Atlantic. We do have growing confidence in snowfall potential, with lower confidence for potential snowfall amounts in North Carolina.\n\nClash of cold and warm air masses\n\nWhen warmer air coming out of the Gulf clashes with cold air rolling out of the Arctic, as is the case with this weekend's storm, bombogenesis may occur. This typically happens as the low-pressure system also interacts with ocean water creating a much more powerful storm that could become a Nor'easter.\n\nHearst Owned\n\nHearst Owned\n\nHearst Owned\n\nHearst Owned\n\nThis rapid intensification can lead to huge snowfalls, flooding and massive travel delays to regional shutdowns due to the severity of weather impacts.\n\nStrong wind gusts, heavy precipitation potential at the coast\n\nWhat a bomb cyclone might do for the Piedmont Triad is create a tight pressure gradient causing higher winds for Central North Carolina. This may lead to power outages as small trees and branches could come down on power lines. There is also potential for coastal flooding and heavy snowfall and wintry mix closer to the coast.\n\nHearst Owned\n\nBombogenesis has been captured on satellite images in previous winters like this one from 2018, one of the strongest bomb cyclones on record for the East Coast. The storm dropped 53 millibars in less than 24 hours, brought coastal flooding to New England, more than a foot of snow to Boston and hurricane-force winds of 76 mph to Nantucket.\n\nNational Oceanic and Atmospheric Administration\n\nFind out more here on the infamous northeast bomb cyclone of 2018.\n\nNational Aeronautics and Space Administration\n\nBomb cyclones are also responsible for severe weather along the West Coast. This image shows a bomb cyclone about to bring devastating high winds and flooding to the Pacific Northwest. The image was captured by the GOES 17 West satellite using instruments to show day and night images with color imagery for the day and multispectral blended infrared for nighttime images.\n\nNational Aeronautics and Space Administration\n\nFind out about Friday evening storm conditions with Meteorologist Michelle Kennedy here.\n\nThis content is imported from Facebook. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMore weather coverage: Weather Alerts | Closing and delays | Latest weather forecast | Post pictures to the uLocal North Carolina Facebook Group | Traffic information | Report closings and delays | SkyCams | Download the WXII12 News mobile app",
        "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNY0NuT3pmaG1OLWtrUHlnWHY0WUlUQk8yR2Z3Q3dubk1jNzVFZnFQQXlWZjVsVGkzT2lwV3FwN0o1SHJVeTZaSFJRUmlZNjc0SFRJdTlyTTJfV2tieUhZYm9QMU9MMXI2ald5MUJuZDJTc0hRM2l0bDg3dFhnWVA4Z1hHSzh5dlFh?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 01:10:00 GMT"
    },
    {
        "event": "cyclone",
        "title": "Nor'easter bomb cyclone storm tracker: Live radar, snow forecast, winter weather alerts, travel disruptions - FOX Weather",
        "description": "Nor'easter bomb cyclone storm tracker: Live radar, snow forecast, winter weather alerts, travel disruptions  FOX Weather",
        "content": "A brewing nor'easter that has a strong likelihood of \"bombing out\" is expected to impact the East Coast this weekend, and is looking increasingly likely to develop into an intensifying bomb cyclone.\n\nGiven the ingredients current models are projecting, it is becoming nearly certain that a powerful storm will develop, though uncertainty remains regarding exactly where the storm tracks along the East Coast.\n\nThere is growing confidence in major snow of up to a foot slamming the Carolinas and Virginia. The scenarios range from a crippling I-95 blizzard to a glancing blow.\n\nLIVE UPDATES: TRACKING THE MAJOR NOR'EASTER BOMB CYCLONE\n\nTrack the weather conditions below with live radar and weather maps that will continue to be updated 24/7 from the FOX Weather team.\n\nFuture track radar of the storm\n\nWEEKEND NOR'EASTER TO BOMB OFF THE EAST COAST, DUMPING HEAVY SNOW IN THE CAROLINAS AND PART OF NEW ENGLAND\n\nSnow totals expected along the East Coast\n\nWHAT IS THE POLAR VORTEX?\n\nWHAT IS BOMBOGENESIS?\n\nHow much snow is expected in the Carolinas\n\nWHAT IS A WINTER STORM WARNING MEAN FOR ME?\n\nHow high waves will get due to the storm\n\nTHESE ARE THE BIGGEST ICE STORMS TO EVER IMPACT THE US\n\nHOW DO WINTER STORMS FORM?\n\nMid-Atlantic and Northeast impacts\n\nMOST MEMORABLE NOR'EASTERS OVER THE YEARS\n\nRARE DEEP FREEZE UNDERWAY IN FLORIDA AS INTENSIFYING BITTER BLAST EXTENDS AS FAR SOUTH AS MIAMI\n\nWind gusts along the East Coast\n\nHOW ONE POINT ON A MAP CAN MAKE OR BREAK A NOR'EASTER\n\nWHAT YOU NEED AHEAD OF THE POWER OUTAGES DURING A MAJOR NOR'EASTER\n\nNor'easter key impacts\n\nTHIS IS THE PEAK TIME FOR MAJOR NOR'EASTERS\n\nMUST-SEE PHOTOS: CRIPPLING ICE IN NASHVILLE DESTROYS POWER LINES, SNAPS TREES DURING CATASTROPHIC WINTER STORM\n\nAirport delays and cancellations\n\nWHAT'S THE DIFFERENCE BETWEEN GROUND STOPS AND DELAYS?\n\nHOW TO STAY SAFE FROM DANGEROUS WINTER ICE",
        "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQRXUzcjZLd213aUY5cG1QYnQwNUN5ZnFEWVViTTZ5azItZjhaMDFUOUJjZEhhMHhERmpYQTJvZ1BtS2NDam1yQkRWVFpZTl9qOTNfQUNPbm9waU81NzNfc1d1MDhXbENKUTN4R2ZvN2Y5NHI2MVUxNmJWcVEtekFiNHFIcFJES2tLSF9VWERtemIybUZfdGRWVGxHM2I4V3V3OHpfNGZnb0tWempM0gGyAUFVX3lxTFBqNy04bnlHY0NGczRTaENTcmt3MEd0N0kyemZrS2pVdDktdndXODFSVUtEdUhSUDh2SnFMQ1RzOHVKVzhzSjZsMElGazNqSkRpcGliWGxRNFp2X0h2ZDd5aHMxcnVaT2NyWWxFQnR4Mm5ONDhsdWlhc0tsTDIyTDBaZm1MbXltcHFNeUVBYmhjZVJ4aFVFdmRqRzlUWWY3dkhnNGN5MEV5R3RNc1JaN3c3eXc?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Sat, 31 Jan 2026 01:14:00 GMT"
    },
    {
        "event": "cyclone",
        "title": "Bomb cyclone updates: Carolinas, Virginia brace for winter storm packing extreme winds, waves and snow - Yahoo",
        "description": "Bomb cyclone updates: Carolinas, Virginia brace for winter storm packing extreme winds, waves and snow  Yahoo",
        "content": "As recovery from a historic ice storm continues across parts of the South, a new and potentially dangerous winter weather threat is set to unfold along the East Coast. A powerful bomb cyclone could bring blizzard conditions to portions of the Carolinas and southern Virginia this weekend.\n\nThe storm comes as thousands across the South, including the Nashville area, remain without power after an ice storm knocked out electricity to more than a million customers and was blamed for dozens of deaths tied to extreme cold.\n\nMore than 140,000 customers remain without power across Mississippi and Tennessee.\n\nNashville could get up to 3 inches of snow along with dangerous cold, as temperatures will stay in the teens and 20s through Sunday. Icy roads and hazardous conditions are expected to persist, further delaying power restoration efforts.\n\nNashville Mayor Freddie O'Connell said three people died in the city due to the storm.\n\n\"We know that too many Nashvillians will remain without power coming into another storm this weekend,\" O'Connell said, encouraging those affected to seek alternative shelter before temperatures plunge again.\n\nThe Nashville Predators opened Bridgestone Arena to people without power on Friday.\n\nAccuWeather meteorologists are forecasting the most severe conditions in the Carolinas and southern Virginia from Saturday into Saturday night. Snowfall rates could reach 1 inch per hour at times while winds may exceed 35 miles per hour, creating blowing snow and significantly reduced visibility.\n\nFrom the northeastern Outer Banks to Norfolk and Virginia Beach, Virginia, blizzard conditions are possible.\n\n\"This weekend, snow and bitterly cold temperatures are expected across much of North Carolina, and strong tides and high winds could cause flooding along the coast. Today is the day to prepare for whatever the storm may bring,\" North Carolina Gov. Josh Stein wrote on Facebook Friday.\n\nOfficials in the Outer Banks announced beach closures ahead of the storm, including portions of Cape Hatteras National Seashore, where 27 homes have collapsed since 2022 due to coastal erosion. Sixteen of those collapses occurred between September and October 2025 in the Buxton and Rodanthe communities.\n\nAhead of the bomb cyclone, sections of beach in Rodanthe and Buxton are closed, including from East Point Drive south to Surfside Drive in Rodanthe and from the north end of Buxton to near off-road vehicle ramp 43.\n\nA Hurricane Force Wind Warning is in place for 100 nautical miles offshore from Cape Hatteras to Cape Fear.\n\nAcross the I-95 corridor and much of the Northeast, strong winds, coastal flooding and beach erosion are the primary concerns with this system.\n\nNew York City, Philadelphia and Washington, D.C., may miss out on accumulating snow, as those areas continue to clean up after last week's winter storm dumped the most snow many locations have received in about five years.\n\nAccuWeather experts estimate the total damage and economic loss from last week's storm at between $105 billion and $115 billion.\n\n\"This is the harshest winter many Americans have faced in the past five to eight years. Relentless rounds of Arctic air outbreaks and blasts of wintry weather have been a dangerous and expensive combination,\" AccuWeather Senior Meteorologist Tyler Roys said. \"Heating bills may be shockingly high for millions of people, from Texas to Tennessee and much of the East Coast.\"\n\nStay with AccuWeather through the storm. Refresh this page and check back for updates.",
        "link": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPY3ltdVBZSWVRTVNEZTd3VEVuVVpiTWhoUFJxaGdJNkdoczNUZVlVM3MwYm54V3BoOHR6Tm9oZWNtV0JvMXNSdlFTVGYxay1SeGhPRlp6Z3k0YUVKQTFqdHBsY1RQWUFjSTFlM1A4dDBTZzhxN0lHWGxRekJ0QXJ2ek5Tb3lKc3hNckxiV0lqLThFNS15?oc=5&hl=en-CA&gl=CA&ceid=CA:en",
        "published": "Fri, 30 Jan 2026 22:55:12 GMT"
    }
]